[{"reviews": [" Good editing app, can't stop notifications I'm uninstalling because the settings don't give me an option to stop notification pushes on my phone.   Full Review   \n", " Omg finally rage fCes I've been trying to edit my videos like jumbo bit I couldn't do it By now I can by the. Way subscribe Killer1o5   Full Review   \n", " Sony Z2 The free version of VivaVideo is excellent.. I guess the purchased version most probably Awsome.. I'll stick to the free version first. I guess if I would to purchase any application in Play Store, this app would be my first purchase. Btw, more and more of my friends are using this app. Use to hv problems with it.. Now it's back on track and the best. Thank you.   Full Review   \n", " Jay After the update I have had the problem it turns my music off when I start recording I liked before when I can play a song in the back ground and record a video and still hear my voice but it is the best video app ever so still 4 stars   Full Review   \n", "  Why does it make people look lighter? Everytime I take a vid with this thing I look like I'm light skinned but I'm not.   Full Review   \n", " Doesn't support front cam files Don't know why because everyone uses front face cameras now a days. Please fix. We don't have expensive equipment to see exactly what we record when we want to be in the scenes.   Full Review   \n", " Is not good to update After i update i cannot edit any video .it saying file not supported.👾   Full Review   \n", " Definitely class leading but not flawless... Just improve the ending of the slideshow video... The slideshow ends suddenly... It should end slowly and the music volume should go down automatically when it is ending..  The ending of the slideshow videos need to have some kind of ending animations and music volume should automatically start to go down slowly when it is ending   Full Review   \n", " I just loved it. This is fantastic app. I can do any thing with this app. Editing of videos and pictures is so easy here. But I want to know that is this app available in Desktop?   Full Review   \n", " It is awesome +amazing I make easy and fun I love making a slideshow with cool music and cute caption pictures   Full Review   \n", " Great, but I really like this app, it's very cool and easy to use, but it is so annoying how every video I edit has to put \"Made with VivaVideo\" in the bottom right corner of the screen. We get it, it's made by this app, you don't  have to clog out screen up with your credits. I don't see any other video editor doing that. If you're  planning on making a professional video, I don't  recommend it, but other than that, it's a great app.   Full Review   \n", " Won't work I won't let me do any thing it just goes back to home screen   Full Review   \n", " Good, but new problems Okay, I make short 6-10 second edits with this app and it has worked great so far. However, today it says the same videos I used to edit with yesterday are now suddenly \"unsupported files\". Please fix this issue.                                                              Update: now it won't even show videos I've downloaded. This has quickly become a serious issue. Please fix this soon.   Full Review   \n", " Doesn't work This app doesn't work with mp4 files. Tried to merge several short 30 second mp4 files and it says unsupported files. There's $3 I'll never see again. What good is a video editing app that dosent support the most common file format. F...for fail!   Full Review   \n", " Love this app Works well, love the fact  I can pick my own music for my video. Slow it down or speed it up.   Full Review   \n", " So cool I love this app so cool had fun love it ...get it now love it so easy to use   Full Review   \n", "  The only thing is how much it reduces ths quality of my galaxy s7 video. Maybe there's some HD option I haven't fund yet. Or maybe I'd need.to buy the full app   Full Review   \n", " Easy use & Fast This app will cut my need of using iMovie for edits.  Every tool, clips and editing run smoothly with no issues of delay.  Reviewing made simple. Overall best video editor on mobile! Never seen or used anything better in this category.   Full Review   \n", " I love it, but.... It would be better if was easier to adjust the pictures to show the whole thing, and the music for the length of time needs tweaking. If I have a whole song, don't cut it off and restart in 30 seconds unless I specifically shorten it to make it do that. Other than that, the themes are beautiful, I think I like it better than Flipagram for the smoothness of how it runs. Fix aforementioned items for 5 stars from me.   Full Review   \n", " Great shop. I love the cool effects of this app...it's easy to use...always gives good quality....the only thing negative is when you post a vid and it gets pulled due to music content...even when it's a song that is within the app...other than that....very impressed!   Full Review   \n", " This app is great Love this app! Sometimes it freezes, other times it doesn't allow me to save the clips of the videos I cut. Otherwise, overall great app. Great new features like adding music, or movie credits and other themes. Really good!   Full Review   \n", " Amazing! This app is so much better than Flipagram.. I love it.. it is a little confusing and can get frustrating if you have never used it but once you get the hang of it, it is one of the best apps I have ever used.   Full Review   \n", " Figuring it out Still new with the app, have to learn all the settings. So far so good   Full Review   \n", " Cool Well,I can't say much but its amazing keep up the good and cool work   Full Review   \n", " HELP! I want to make a THUG LIFE effect...please put the shades and cigarrete in stickers or fx. Thank you!   Full Review   \n", " VivaVideo:Free Video Editor THIS IS THE BEST OF THE BEST VIDEO MAKER , I HAVE EVER USED--ITS EASY TO USE , RUNS SMOOTH--JUST PLAIN OUT AWESOME. I WANT TO THANK THE DEVELOPERS FOR AN AMAZING , GREAT JOB!!!! 5 STARS ALL THE WAY!!   Full Review   \n", " Just what I needed Love it! Very versatile. Easy to use and just what I needed. I am able to compile all my Clips put them together in one long high definition video and get rid of all the clips. Very convenient   Full Review   \n", " Great app! Wonderful and it works 100% but sad with the watermark.   Full Review   \n", " Me loved it Its so easy n many options there n user friendly the best vedio making appp better then dubsmash n all   Full Review   \n", " Great App The app is amazing, great features. I wish I could go back and add pics even after I have stated creating the slideshow. I'd love also if I could drag and arrange the pics as I'd want to. Nonetheless, a great app.   Full Review   \n", " VivaVideo love it! I really really love it there are cool themes cool effects and more love it!   Full Review   \n", " Pretty crazy app.... ....make cool videos with the power of your smartphone, super easy to operate.   Full Review   \n", " AMAZING I can edit photos that looked horrible and I can make cool videos   Full Review   \n", " Effects The software has one of the finest effects for short videos. Loving it   Full Review   \n", " Worst app ever Fix please! Why the hell do we create a video if we don't want to save it. Why should we pay for saving a video? Please fix it, every one in this world does not own a credit or debit card   Full Review   \n", " Viva Video I really like it, I paid for the $3.99 to unlock all the features but what is irritating me is that when I'm editing my videos and I choose a theme, the theme is not applied to the video. It freezes and it won't work. Out of all the themes around only 5 work. I even uninstalled and reinstalled but nothing changed. If you can fix this problem then it'd be great. Thanks.   Full Review   \n", " Amazing This app is amazing and recommend every one to download it😍the only thing is it needs to download most of the themes and filters etc.   Full Review   \n", " Not able to use the app in Samsung J7 On using any modes of the app, the screen turns black and the user is nabigated to the previous screen. Plz come up with a fix.   Full Review   \n", " But... Pleas add fnaf animechtons! I still love it!   Full Review   \n", " every time download thems and etc hated becouse need evry time download contents like themes fx filter its to lossing data so change needed to download one time no need downlaod next time   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.quvideo.xiaoying", "title": ["  VivaVideo: Free Video Editor ", " "]},
{"reviews": [" The best! Super easy to make Video it give u step by step on how to make it and what to do! But the only problem and it's just me is music wise couldn't download a song for my video but all in all perfect!   Full Review   \n", " Amazing....... Wow.. this aap good working. Nice thems & slidshow. But mantion new options plz nxt upgrade version all sideshow mixed. Bcoz all pic show in movie  different different slideshow.   Full Review   \n", " I love it I used this app for my mom's, sister, bff mother's day videos. They loved them and so did I. Just dislike you can't take out pics after you see you don't like them in the video.   Full Review   \n", " Amazing.... It's was an amazing app..enjoying alot with this app..i am professional editor and this app was so easy to use..but there is a problem in text we can't put two or more lines in video at a time...either i will give 5 star for this app..   Full Review   \n", " Nice app Easy to use.  Make awesome video within a minit.  Best part it's just easy to use....   Full Review   \n", "  Awesome app! I love it! Easy to use. Better than the other. This is so far one of my favorites. :-)   Full Review   \n", " Love it but it has some errors and Doesn't work at all for honor phone and Huawei It doesn't match on my new phone after I installed it and for the first times I wanted install it,it says so sorry your phone doesn't match with this version after some update it installed but it doesn't work and close over and over with same massage to me .it was so painfully and horribly. I love this app but ...   Full Review   \n", " LOVE IT LOVE IT LOVE IT I love this app just wish I could add my own music to the video I make   Full Review   \n", " Lovely It's just great.so easy to use and amazing themes.It's  just  an perfect app .It's very helpful for wishing anyone for any occasion.coolest app ever.And best photo editor  ever........   Full Review   \n", "  Good aap but the only problem with time bound. If play time can be extended, option to add multiple audios and   extra effects added it will be the best aap.   Full Review   \n", " Just awesome! I have made 2 slideshows using it. All good but I have one question. How can I see all my added photos in the slideshow? The slideshow length needs to be adjusted to showcase all my photos. How can I do that?   Please help!   Full Review   \n", " nice apps nice apps, very usefull without any sjngle touch, well done   Full Review   \n", " Says creating video......removing watermark forever Would be an awesome app with a zoom or cropping feature, All the pics are zoomed in on,and for the life of me I cannot get it to save,after I've completely finished my video I go to save it,it says creating video....removing watermarks,hits 100% done then its just stuck on that,there's no ok button nothing,if I try to back out, it says its not finished do I want to cancel..??????   Full Review   \n", " It is not bad Although its not bad its not that friendlyp and i dont like the idea of cropping the pictures and this doesn't even give an option to crop or either leave it the same. Please fix this and i will give the app 5/5   Full Review   \n", " nice but need some more options cant it b possible to re-arrange the pictures manually while making the video?   Full Review   \n", " tis app is amaing THIS APP IS AMAZING THE FIRST TIME I MAE A VIDEO WAS FOR MY MOMS BIRTHDAY AND IT MADE HER CRY IT WAS AMAZING!!!!!!!!!   Full Review   \n", " Loved it It's simple to use and has beautiful themes. Loved the mother's day theme.   Full Review   \n", " Minimovies Amazing i created  a movie and I Loved it you can use it for any gift. Only thing is mothers day themes  are a little  dad .   Full Review   \n", " Awesome It's my first review on playstore need to say it's best app to make a movie with pics and music easy and very convenient   Full Review   \n", " Already made two videos! Amazing. Rate 5 stars everyone! Should download. If you hate this app, you are crazy!   Full Review   \n", " Love theme Please add theme for girl friend....lovely theme ....this aap is mind blowing i am a big fan of this...Please add more love theme   Full Review   \n", " The video won't be as clear..... I love it but when I  download or share it the person on the other end doesn't receive a clear video. This has happened twice. The video gets corrupted and disturbed 😡 please fix this issue and I'll give 5 stars   Full Review   \n", " Fantastic apps.. Very simple to use...love it...awesome apps   Full Review   \n", " I hate it bcz I can't save the videos n forward to loved ones. . Waste of making videos. . N can't do any adjustments to photos I hate it   Full Review   \n", " Extremely nice and useful.. Each and every pic together combines to form a wonderful video..   Full Review   \n", " Very good app! Nice and easy to use. Great to store memories in the way. Love it so much! Keep it up and look fwd for any updates.   Full Review   \n", " Movie making is super Like all slide shows with music is wonder full.and vedios also.keep it up and plz develop this app   Full Review   \n", " It's not workin for me I only gave it 5 stars is because my mum tried it and it's great . But when I press INSTALL it's says to download pending.  Can someone tell me what is a pending ?   Full Review   \n", " Superb Apps! Exactly what I need, for my VLOG of traveling trip and sports activity! TQ developer.   Full Review   \n", "  The BEST app ever If I had to chose 1 app to be the only one I would ever have this would be the one I couldn't live without   Full Review   \n", "  awesome app I can make all the memories stored in my facebook like Im just watching it from that time   Full Review   \n", " Awesome.I loved it It is a user friendly app. One make a movie  out of the pictures with good background music of his choice.   Full Review   \n", " Nice one Glad to use this app. Wish could make longer videos BUT this will def do. Good job guyz   Full Review   \n", " Loved it too much. Though would love if I can put more pics. :D Loving it! Im using it for every family trip that we had went. Though, I would give 5 stars if I can put more than 60pics! Combining mini video would be an extra awesome feature if have.   Full Review   \n", " Great App! Love it Love the app. There should be option of video compression in order to share with site that have lower sized files. A great app   Full Review   \n", " It's ok According to my opinion it needs more improvements. It's battery and ram usage is high but not hanging. But it's an excellent app.   Full Review   \n", " Superb It's the only wonderful app which I installed I tried many apps but didn't see this type of nice app. Everything easy   Full Review   \n", " Kind of pointless If you want to truly customize the video, you're wasting your time (and this is not mentioned until you read the help files.) You can only use a max photo count of 20, and even then you MUST use their pre-made themes which have a preset video length (you cannot extend it) and don't use every photo   Full Review   \n", " Doesn't save music when downloaded Nice little app to create slide shows and mini movies, managed to add my own backing music but tried 3 times to download and each time it lost the backing music on download.   Full Review   \n", " Awesome This is one of the gratest app I have ever downloaded. I made a slideshow for my mom because it is mother's day. Now I have a surprise for her👌👌👌👌👏👏👏👏👏👏❤❤❤❤❤❤❤   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.asus.microfilm", "title": ["  MiniMovie-Slideshow Video Edit ", " "]},
{"reviews": [" It's really good I recommend getting this app, I'm a YouTuber and edit my videos with this. Make sure you play around for you can get the hang of it   Full Review   \n", " Import old projects I just upgraded to pro and I'm wondering if there's any way to import old projects/draft that I had on the free version. Is there a way to do this?   Full Review   \n", "  Needs more features but still worth the purchase.. Please add the ability to slow down or speed up sections of a video clip and not just the ability to do the entire clip.. With sections edited for speed will make for s much more professional presentation!   Full Review   \n", " \"HD export, not HD.\" Well I uploaded a file in 1080p hd and when exported to gallery.. it automatically exported to 380 quality.  Not happy with this.   Full Review   \n", " This is so... ah.. I have no words thanks for this amazing app. I don't buy an app. ever. except that I know it's worth it. This is def worth it. I would like to request more themes and fx. Thanks   Full Review   \n", " Torn I want to like it very much. No other app I've tried makes trimming clips as easy. But ... I put up a video made with this and immediately got a copyright ding because of the song. And I paid for HD version and there's no HD export. So I feel like I've been deceived.   Full Review   \n", " Very Good I'm still trying to figure out things, but mostly its good. It makes cute little videos. I haven't had any problems with anything. I wish it had more music though.   Full Review   \n", " More features pls I hope you will add more themes,stickers, music (etc )for different occasions .. both free and with charge.. i used birthday theme. And annoying to use it again haha ofcourse my viewers will notice same theme.. with the songs i just downloaded to other sites. thanks  -pls add video rotate tool..  getting problems on video quality and sound.. never happened before   Full Review   \n", " Help!!! (UNSUPPORTED FILE) It doesn't let mi edit my vids,and it puts unsupported file,before the update this did not hapen!!!!\"\"\"\"\"   Full Review   \n", " GALAXY S4 Doesn't let me do anything when I click something it lags then kicks me to viva.videos home screen   Full Review   \n", " Pretty good Vid quality isn't great. Really easy to use. Wish it had more music to choose from   Full Review   \n", "  It works perfectly fine until you try and put a filter on. The fairy filter turns out okay until you send it to instashot or save it, then it just has random blocks of pixelated colour.   Full Review   \n", " Video Quality not good 👎 Before i have a free app then i pay the pro version to fix the video quality but it still same the problem ... it's most to be HD video. . But it's not 👎   Full Review   \n", " Great app, but crashed to many times, however I still like it Very good app, but I wish it didn't  crash so much. It might be due to low space on my phone.   Full Review   \n", " Not bad The only problem is that I can't add two different songs nor stop the music at the right spot I wanted it to.   Full Review   \n", " Good app Thus is a good app with many features. I just have one complaints and that the video quality. They should really let you pick your quality.   Full Review   \n", " Didn't work for me I wanted to use this app to rotate a video. It worked, but shrank the frame down to about half of full size.   Full Review   \n", " Bought, hour later says all my files are not supported! ! I loaded free, worked, wanted to get rid of water marks, then pro worked for only an hour, then says all my files are not supported! ! !  Refund my money please   Full Review   \n", "  As I keep using the app whenever I add the videos it used to go by fast but now it is very slow and it doesn't let you keep the old videos it just deletes it for you so now I keep on re-installing so please fix it thanks   Full Review   \n", " Really  love this but... Every time  I  add a clip, the  music  stops  working  please  fix   Full Review   \n", " Like this app, use alot alot but... Please put in a video clip volume adjustment..... Please! This app would be perfect with it. As of right now I have use other apps just to boost the clip volume.... It's an easy update, just let me adjust clip volume and I'll keep promoting and using this app. Thanks.   Full Review   \n", " No change with update. Won't let me select files Just updated the app and it STILL won't let me select video files!! I paid for the Pro version and every time I try to select a video to edit, I get an error message of \"Unsupported File.\" I've emailed the developer with no response. Took my money for a product that doesn't work. LG G4. I've sent example video already.   Full Review   \n", " It could be better if it has full HD. The App. is better then I thought, Its easyer to use. But it does not have a full HD1080p. I have a full HD video 1080p , after it process it the quality of video is half hd 720p. Maybe they designed it just for mobile phones only. I just upload a video to youtube, if anyone want to have a look the sample, go to ( rc plane, how i built my foam rc plane and flew with pixhawk, switch to rtl crashed) I just bought this app a few days ago.when tranfer file don't convert it.It should work ok when using mp4 files   Full Review   \n", " Nothing is pro about it Not any better than the regular viva video and I had to purchase it (it only allows for more than 5 min videos) .. the regular version even had an amazing update and this is old af .. the frustrating part is that I can't transfer my old studio drafts to the new one ( which is the reason why I purchased it in the first place )   Full Review   \n", " Yes, I reaaly like it But I became utterly disappointed when I saw the quality of the exported video, oh, and the SOUND , it is unbelievably bad. But the ideas, music, being totally user friendly and the speech bubbles are better than great. Nevertheless, only if you manage to bring up the export quality to an acceptable level, will this app be worth-buying.   Full Review   \n", " Not all devices can export in HD My Nexus 5X can export HD, but my Nexus 10 can only do SD. There's no way to share draft videos across devices. Very disappointing finish to an otherwise great app. Check your device before spending too much time editing a video.   Full Review   \n", " Don't change just enhance! Made my first video and it was so fast. Maybe it's my new phone. I enjoyed all of the features and it's simple. Keep updating this app. For YouTube users like myself it's a great aid to my montage videos for my video games.   Full Review   \n", " HD Export error \"It closed automatically when i export the video..why, anyone knows ??? \"   Full Review   \n", " Not exporting I created a video and i purchased pro so that i can share it with my friends. Unfortunately, when i try to share, it will say \"exporting\" and after completing 2% somehow, it will go back to the previous screen. It doesnt even have the courtesy to tell me what the error is.  I could create a nice video with this and now i am stuck. If you could give me a solution then i will give 5 star   Full Review   \n", " Love it I dont see any problems, honstly this one is better then the viva video that is free I think you should just buy the app, and if you do buy it I promise you you'll fall in love  with this app as well   Full Review   \n", " WHOEVER MADE THIS APP- HELP ME ASAP NOW I was using this for a recording when I went over 5 min. I bought the full app but it said that the video loading failed when I had great wifi. This is a group project for school and I definitely don't want it to be deleted. PLEASE. WHOEVER MADE THIS APP, PLEASE PLEASE PLEASE CONTACT ME TODAY OR AT LEAST TOMORROW OR ELSE I'LL GET A REFUND. NOW PLEASE!!!!!   Full Review   \n", " 5 Star Goodness! Wow! I have to admit, this might be the most best editor I have ever came across to! I just made a short Diet Dr. Pepper commercial with it! Thanks, VivaVideo!   Full Review   \n", " It's good but It a great for editing, got a lot there but if there's a way to export in HD I haven't been able to figure it out. Uploaded a video to YouTube and the quality came out at 360 and not in the 1080 HD that I recorded in. I thought the paid version would let you do that.   Full Review   \n", " Worth it Very user friendly and easy to pickup. Tried another Video editor that that fell under the \"Editor's Choice\" and I must say this app far surpasses the other in my view. 5min limit w/o But you gain unlimited for purchasing. I bought it simply because I was impressed with the time I spent using this app. Nicely done 5/5 LG G3   Full Review   \n", " Does not work with Android. Does not run or load at all. Customer service has not responded. Don't waste your time or money.   Full Review   \n", " Liked editor videos by iSpartaFujitec It's really liked the \"VivaVideo\"... Just is replace the video editor is: Cute CUT. Because in Android can't editing video use Cute CUT, only in iOS. Android only editing video on VivaVideo.   Full Review   \n", " Really great I really like how I can import multiple clips with such ease. All the effects are really great. The only bad thing is the sizing. If u could make it full screen, then i would give it 5 stars   Full Review   \n", " Video Quality is Poop Good for simple videos like vlogs which require minimal editing, not good for voice-overs to cover up jump cuts however, (choppy transition going from clip to clip) and when adding music it fades the music at the end with no option to turn that fading off. But, the biggest issue: you guys need to improve this app by allowing HighER Definition than 1080x720! This is soon important, cause even at 1080x720, when you upload it to YouTube the quality goes down.   Full Review   \n", " Worst app I ever used, doesn't work and no response after 3 emails This app doesn't even work, unsupported on both paid and unpaid version, Android video worked first time, tires to contact these guys for help numerous times with no response, will Uninstall and spread the word on my forums how horrible it is, what a joke.   Full Review   \n", " Great video editing app for android Great video editing app. Moved to this once Google auto movie wasn't compatible with my one plus one. I don't need all the cutesy themes and speech bubbles and  wish it had better music choices or easier to add your own music. But overall, easy to use, and share. Get the pro version..worth the price.   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.quvideo.xiaoying.pro", "title": ["  VivaVideo Pro: HD Video Editor ", " "]},
{"reviews": [" all it can do is to play video? i selected a short video, selected an audio file to cover, started  playing... and there is only original audio from video... it appears to be made by some chinese cr*p factory... the counter of files is in chinese   Full Review   \n", " Helpful with my :YOU TUBE Channel Cool but sometimes lags when you Edit photos. I still recommend you get this app! Oh and also check out my YOU TUBE channel!!! Is Chris Emz Hayden but my profile is LULU (25)!!!!   Full Review   \n", " Feeble, useless, ad filled rubbish Cannot be used for proper editing as cannot join several clips.  Spent ages creating short clips then tried to merge them.  Stopped at 20% encoding for several hours each time,  Waste of effort.  Xperia Z5 so should have had enough power for real editing.   Full Review   \n", "  It cannot work simultaneously most of times when I use other apps and the video I made did not even get saved..   Full Review   \n", " This message is for developers I'm not going to give five stars just cuz you asks. That's the only reason i gave 4 stars   Full Review   \n", " Good,but one big bug! One big bug i try to 4 videos in fast-motion 2 videos takes 2 minutes,one is 53 seconds and one 23 seconds and 2 pictures of 2 sec.and one song wath takes 5 min...Pleas fix this bug or i will find better video editor.   Full Review   \n", " Not cool They tell me if I give them a five star they will make it better but it doesn't   Full Review   \n", " Awesome This app is the most 10 out of 10 app ever I would recommend it to anyone who wants to be MLG and make good videos true legends never die download this app from the App Store now. Do not wase ur time m8 become a quick scopeing memer today with this app. Dis app so dank do get it now m8   Full Review   \n", " It okay but there is something that is bugging me Okay so the app is good I like it but when I put music well it starts to freak out when I preview it like a TV with bad volume but other that that it's a really good app   Full Review   \n", "  I would rate it 5 stars if it didn't take so long for 2 videos to merge together   Full Review   \n", "  Useful, but doesnt let you do much, i would recomend it for converting, cutting, and merging vids, but not for a full on studio   Full Review   \n", " Easy to use Suoarb app...nice additing......easily u can make ur favourite pics video   Full Review   \n", " Is there watermark Haven't went on it. But there o's one question, is there watermarks?   Full Review   \n", " Pretty much useless. Distorts the audio of all HD videos.   Full Review   \n", " Video So far I like it but like to b able to add Google music to my videos   Full Review   \n", " Epic It is so good so get it  pls check out my you tube channel   Full Review   \n", " Amazing Because I can finally do my YouTube channel   Full Review   \n", "  This is a very good app. It has mate my expectations.   Full Review   \n", "  Can't edit big files. Avoid second based cutting . Give minute based cutting of videos.  Give mp3 cutter. Give to add song where ever we want to apply on videos   Full Review   \n", " Okay I'm not a big fan but it works ok   Full Review   \n", " This is horrible So I try to make my videos but says fail to open video and I loose all my work. I hate this fuvking app.   Full Review   \n", " Yay I'm just so easy to make intros and outros   Full Review   \n", " App is bæ It can do what any other app can do, it's great   Full Review   \n", " So bad It distorts the sounds on my video, making it sound like it's playing through a roughly cut tin lid -_-   Full Review   \n", " Great app Takes a little bit of time to merge videos   Full Review   \n", " Bullshit Downloaded this thing for a class project. Everytime I finish editing the video it completely cuts off the sound replacing it with a high pitch noise sounding like nails on a chalkboard. Deleting this asap. Literally had this app on my phone for less than an hour.   Full Review   \n", " Crashes Sometimes when selecting a file Please support my Droid Razr Maxx running 6.0 Marshmallow and then I will rate five stars. Edit : Thanks for fixing the issue.   Full Review   \n", " My scooter vid It made my scooter vid look awesome   Full Review   \n", " Perfect This was an amazing app for helping me finish a school related project!!!   Full Review   \n", " The best way to do Thanks again for this app   Full Review   \n", "  Keren banget. Aku suka cara ini gampang banget. Recomended bgt lah   Full Review   \n", " Amazing app Easy to use. Not one bit complicated   Full Review   \n", " Good Helpful with youtube check out my channel RyanJH blue and black skull (face)   Full Review   \n", "  Was wrkin really fn bt nw stops in d btwn   Full Review   \n", " So awesome I just made my first slideshow   Full Review   \n", " Just 5 stars Because this app is great!   Full Review   \n", " You tube I will use this app to edit my vedio   Full Review   \n", "  I dont know how to use it   Full Review   \n", " Disappointed It messed up the audio when I merged my video clips. - Samsung galaxy A3 (lollipop)   Full Review   \n", "  Being searching 🔍... Thank 💫 God I've found....   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.movisoftnew.videoeditor", "title": ["  Video Editor ", " "]},
{"reviews": [" Ahhh Jus 10 photos with 30 seconds limit.. Too bad. I wish it could be longer n more photos could be added.. Ohhhh.. The music ends first with 2-3 photos left in the slide show.. Why is that??   Full Review   \n", " 30 second limit! I wish it could be longer. Also when I saved it after I researched it it cut have the music out of my 39 seconds (I can't type well sorry) please fix   Full Review   \n", " 30sec time limit Intuitive app but 30sec time limit for your own audio files!!??   Full Review   \n", " Photo video editor..... The most time limit is 30 secs with 10  scenes..... Its outstanding.....   Full Review   \n", " Bad You can not make video more than 30second, so I delet it   Full Review   \n", " Worst It wasn't good but we can use it when we get bored or excited  when we want to edit a photo to video   Full Review   \n", "  Its nice but 30mins ,it's way too short   Full Review   \n", " Fabulous Just awesome! I used it to make my FB profile video!   Full Review   \n", " Steve Music tracks FAB, need a PRO version that lasts about five minutes,  30 seconds Way to short.   Full Review   \n", " I love this app So thanks   Full Review   \n", " The Chandra Times nice apps   Full Review   \n", " Good but Sometime not working   Full Review   \n", " Is look nice (I LOVE IT)   Full Review   \n", "  Only 10 pictures maximum   Full Review   \n", " Dilsad ahamad mai bowai   Full Review   \n", " Mind It's ok   Full Review   \n", "  Loveable aaps   Full Review   \n", " Good Play store   Full Review   \n", " Amazing app Best video maker app   Full Review   \n", "  Amazing   Full Review   \n", "  Awesome Awesome!!!!!!!!!!!💯%Awesome!!!!👍👍👍👍👍👍👍   Full Review   \n", " bad only 10 sece video ok   Full Review   \n", " Love IT love app   Full Review   \n", " Nihal ahmed Se   Full Review   \n", " Awesome I love it   Full Review   \n", " good vorry good   Full Review   \n", " Nice Nice   Full Review   \n", "  Waste   Full Review   \n", " Useless Completely useless   Full Review   \n", "  Tight he   Full Review   \n", "  Like this app   Full Review   \n", " Tv Gf   Full Review   \n", "  No use   Full Review   \n", " Wow Hii   Full Review   \n", "  No audio   Full Review   \n", "  Photo aditer   Full Review   \n", " Mr.Dilipkumar Hi   Full Review   \n", " Justine  beiber Omg  very  ridiculous  I  hate  this   Full Review   \n", " Shahid Shahid   Full Review   \n", " Kumara Kumara   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.zentertain.videoflip", "title": ["  Photo Video Editor ", " "]},
{"reviews": [" A bit buggy Sometimes when I trim a video it cuts it shorter than the setting, yet others it adds time to the video. Same with adding music and merging. I merge two 3-second videos and get a three second video, or one half plays normal and the other plays at a faster speed. PLEASE. LOOK INTO THESE ISSUES.   Full Review   \n", " Not worth it! Yes, it is Free, but how much is your frustration cost? Whatever I needed was in pro version of the app, and after fighting constant pop ups with option to buy pro version, I've decided that I have better options out there.  You are getting what you paid for is very true. I just have to remind it to myself !   Full Review   \n", "  Well I think the problem is that you guys should add vidos that we can see so we can edit them also you should let us use um download so we can put a intro for you tube 🙋   Full Review   \n", " Spent money for nothing not big deal but still is crap how can promote s...like this Interfere with my personal videos which I never tried to trimming or whatever. ..wtf???? Just deleted thanks for your support 4 stars my a....   Full Review   \n", "  Worked great until the one time I genuinely needed it for a school project. The audio is fine, but there was no visual. Thanks for the stress, you guys.   Full Review   \n", " Lost 1 Star for 720P limit, lost 2 more Stars for decompressing Merged output Video and making it blocky (useless) - Need a means to Zoom in for Cropping and the Back Button takes a very long route back. TONs of Features, huge Menu. Seems excellent for great Features but ruined by low quality output. Lots of Features not available on other Android Video Editors. No Watermark. Faster processing would be OK, but it's fairly quick. IF it had lossless Crop and Rotate (like for JPG) it would amaze.   Full Review   \n", " How Is it 4 star? It works somewhat but doesn't worthy of the time.   Full Review   \n", " Good, but need some bug fixes: Missing text outline option // \"Crop region\" is very inaccurate // missing \"remove audio\" (opossite from \"extract\") // from default phone's camera, there's no direct way to send to this app (\"share\" shows other apps, not this one). Hope to see future releases!   Full Review   \n", " Changing file name When I convert a video to audio it adds a \"_00\" to the end of the name automatically after it saves the file. It won't show in the name until I look at the song name. This is a new issue. Please fix and I will change rating back to 5 stars.   Full Review   \n", " Good app 👍👍 The Best ive come across....it is just lacking one thing for me if they made it that u could complile your  videos into one single video this app would be perfect i'd give it a 6 stars.... i am impressed   Full Review   \n", " please fix this error!!! There is not enough space in my SD card.. At first this app was downloaded in SD card.. Then I moved it to phone.. But when I wanted to trim the video which was in SD card.. It don't store it in phone and says.. \"There's not enough space in SD card\".. Please fix it!!!   Full Review   \n", " Perfect for editing my soccer vids I could cut and trim in between videos, take out segments, merge them, very good and hasn't ever crashed unlike some others I've tried, although I do have an Android Huawei (more new than old) I use it to edit clips to 15s for instagram and haven't been disappointed,   Full Review   \n", " ITS MISSING SOMETHING I wish it made us speed up/fast foward some parts   Full Review   \n", " Only one issue When trimming a video the interface doesn't show the time of playing a video. Resolve and get 5 stars   Full Review   \n", " Drew Its a useless app. Keeps crushing wen I try trimming videos. No need to waste time and money on such apps. Google ought to take it off   Full Review   \n", "  I like this application for its great \"Trimming\" option. It has the flexibility to Zoom plus and minus which enables to trim videos accurately. However, its free version lacs the opportunity of video merging for videos larger than five minutes. It's very sad!!   Full Review   \n", " Thank you I cannot say it enough. Thank you! Thank you! Thank you! I searched for 4 hours, for software on the computer or an app on the phone that would let me crop someone out of a very personal, very special video i was making for my family. Before i downloaded this app, i installed 3 different softwares on my computer and five different apps on my phone.  All had issue's in some way or another,  whether it was formatting, price ($50!), or not being able to pull a downloaded video. Your app worked seamlessly!   Full Review   \n", " Great App This app is packed with features and it's  the free version . Really good picture grabber from video. Does frame by frame capture. Love all the editing tools and being able to add music to videos and slide shows. Really worth downloading. Best picture from video I've found, worth downloading just for that.   Full Review   \n", " It's pretty good but... It's a great app and video editor. My only problem is that it takes forever to apply changes to videos. Please fix and I will rate 5 stars.   Full Review   \n", " Very good editing tool! So far it has delivered as promised. Very easy to use, UI friendly. Lots of functions. More than I expected from a free version app. I can't recall it crashing. No intrusive ads. I recommend this download, why not? It's a full fiver for me.   Full Review   \n", " Not working Im trying to merge videos and the highest it will go is 57% then stay there and I've been waiting for an hour now. It goes really slow to 57% and then won't go any further   Full Review   \n", " One small problem. I got it to work so 5 stars cuz of everything it can do. The thing is that it takes sooooooo long to load up. Sometimes I need to restart my phone, but once that's taken care of its an awesome editing software!!! :)   Full Review   \n", " Good app.... I like this app it worked awesome...... but when I convert a video, at the time when I overlooked any app then this app is not working. ...so I ratings 4.3   Full Review   \n", " Not all that This app is ok. It has some pretty good features that I like but it's just sad that you have to pay just to get more features done on your videos. And what also sucks about it is that it leaves a watermark or a logo on your video. It may be fine for some users but not me. Delete!!   Full Review   \n", " Very easy Just good, and it is all you want to créate that video or a parts of it you wish to keep in your phone!   Full Review   \n", " Its cool Its cool,cd rate it five star if the complete version was free   Full Review   \n", "  I can do just about anything I might want from a free video editing app!  Really like it :) Keep up the good work, guys x   Full Review   \n", " Add music to your video! The music has a volume control. You decide the volume, and any other changes you make to your video!  Best I have used! Thank you for a free app with many user options!   Full Review   \n", " Hamed Al Zeera Incredibly useful,  couldn't do without it , thanks for a job well done.   Full Review   \n", " Best Video Editor Ever! But the only reason I give it 4 stars is because sometimes when the videos are cut, they're longer or shorter then what i cut   Full Review   \n", " Deleted video Tried to edit a video of my son and when I finished and exited out of the program, found it completely deleted the video! Precious moment lost.   Full Review   \n", " G/A Pls. also make available much more image editing tools. & improve the speed a bit.   Full Review   \n", " I'll give it 5 stars if you can solve this problem The video is perfect but I can't upload it to YouTube. Is this a bug or my device? I have tried uploading but it always says that it's 0 seconds long. I make nightcore videos and this doesn't help. Could you please help?   Full Review   \n", " Awesome Very easy to crop, I tried more then 10 app, but this one is best one, other app very complicated, very hard to understand & use,  I love it this app   Full Review   \n", " I'd give it more It's not wanting to merge videos for me anymore. I love this app because I can trim my videos to any size and I need them to merge like they used to.   Full Review   \n", " Question Without using 'Pro' version can you cut parts out of the MIDDLE of your videos? If so please, please tell me how. Except from that, enjoying the sheer variety of other things you can do with videos. Thank you   Full Review   \n", " Wish you could edit more than once If I trim the video, once it's saved, you can't edit any more... still good though   Full Review   \n", " What the hell happened? Don't even try to link clips together using this anymore. It just completely freezes the video up while the audio continues on. So awful.   Full Review   \n", " Awesome If I can't have you let love set you free to fly your pretty wings around Pretty wings, your pretty wings Your pretty wings, pretty wings around   Full Review   \n", " Useful I love this app and it can get even better by a little effects   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.androvid", "title": ["  AndroVid - Video Editor ", " "]},
{"reviews": [" Fanbloodytastic Great app to quickly and easily edit your videos from home made or created on a console - more FX added all the time Just a MUST have app for all YouTubers - This app just keeps giving and giving Fantastic love it   Full Review   \n", " Already purchase Why it became free version again and again?  How to resolve this?   Full Review   \n", " It's alright... I have to download another app just to get my video produced? Really? And my video won't load to Daily Motion...I'm not too happy.. Can I get some help here?   Full Review   \n", " Best movie making app hands down I am a retired software instructor. I've used many movie making softwares. This is the best! However, that said, it could use some improvement. For instance... One really has to jump through some hoops to save the movie in a place that will sync with other devises and save, like OneDrive. Right now, you have to save it to the Gallery first. Then, upload to Google Drive. Then, move it to the folder you want. Big hastle! Another issue. Can't edit \"voice over.\" Also, you can't add anything to the beginning without messing up the locations of the added text, or voice over stuff.   Full Review   \n", " Please add gifs pls You responded with picture overlay i need dank gifs pls i will literllay get everypnes phone i know and 5 star u. plssss do it   Full Review   \n", " Awesome but.. I'd like it alot more with the ability to add your own font instead if using default font kinda makes the app unusable for me since I use special fonts in my videos   Full Review   \n", " Its good but I love the app but I wish it could transition for shorter clips and I wish it had the shaking video effect and the glitch sfx other than that its amazing 💕   Full Review   \n", " Finally! An almost normal video editing app! First App I ever bought. Needs less useless media fills. But, otherwise straight to the point. Seeming how samsung didn't put one on my galaxy s5 mini. Works well...for what I needed. I do experience some audio issues after editing...downsampling....and weaker audio track after upload.  Does it normalize the audio? Or change the audio structure after production mode? Issue - video layer - image layer - text layer - audio when video.image.audio. editing needs snap to end. Turn off pan/zoom on load.   Full Review   \n", " It's amazing! But, it won't produce. This is by far one of the best video editing apps I've very used! Simple, easy, and a lot of useful features. But for some reason, my video won't produce? It loads up to 77% then says there was an error. Please fix!   Full Review   \n", " Its Amazing! Everything is perfect about this video editor! It is perfect and suits me well for creating professional videos for my YouTube career. However... there is ONE thing that would make this video editor even MORE perfect - 60fps support! Other than that, this app is absolutely marvelous. :D Keep it up!!   Full Review   \n", " NEED HELP Movie production pausing at 95%!! Why is the video not fully producing? Please, help!!!   Full Review   \n", " Cool app. Lags can be fixed tho Cool app for editing videos in your phone.Quite laggy at times, hope that gets fixed. Other than that,good app, i like it.   Full Review   \n", " Keeps freezing This editor was my favorite editor until it keeps being choppy and it freezes all the time. It gets to the point to where I can't tell what I'm editing. Would definitely give five stars but that is the ONLY issue please fix!!   Full Review   \n", " Most powerful editorial on platform... Paid for the app via the in app purchase  because I really like the app  it's one of the more powerful ones on Android  however  auto update was on and the app  version I just paid for was deleted off my phone somehow  and the new one wasn't even reinstalled. I made my complaints  and now after a month the watermark area is gone all of a sudden on this app again??? (Update) everything is fixed now, it does need .wav audio support though   Full Review   \n", " Unable to produce movie The app is really great and after making a beautiful project am unable to produce movie I tried so many times but it goes blank. I have ample memory space. I cleared cache still!   Full Review   \n", "  Wish it would render video in the background so I could do something  besides stare at the producing video screen. Android vid pro runs in the background.   Full Review   \n", " Best vid/pic editor I've found My only problem has been with importing my footage/music into my project. It doesn't give me an option to import my songs from Google Play Music. I wasn't able to transfer direct to my device and therefore, couldn't get access to them. I couldn't import footage from anywhere other than gallery which didn't have them . My Drive wouldn't show any files in it when they were definitely there. After all that, I got one video uploaded into Gallery to then be told the format wasn't compatible...Help please. 😊   Full Review   \n", " Watermark :( To me its the best video editor that anyone could get on all android devices. But I just had one problem and it is the watermark. One time when Im editing my video using this app , I thought it was really great. Theres a ton of stuff that you can do but then I use different (fx) in each of my video and merge it into one. The watermark just ruined it. So pls pls pls can you remove this one thing? Thats all I wish for and if you do, that would really make me happy and it'll be perfect indeed!   Full Review   \n", " I LOVE IT. I LOVE IT. I LOVE IT. You can tell i love it because the tittle has all capitals in it. I have been serching for wver for a good video editing app and i found this ome and i love it. Is is easy to use. It is for begginers like me. If you are loogking for a good video editor app this is the one for you. This app deserves a 5 star. If the free version os this cool imagine the full one. I might buy it for my self.   Full Review   \n", " Looks good Works excellent but can't find several advertised functions ie; pip voice over etc. My galaxy s6 chip IS listed as compatible. However simple functions work excellent. I also cannot find a rotate or flip function to correct portrait v landscape problems. UPDATE: I guess I'm a little weak working this app out. Found all the functions and they all work EXCELLENT!! Still can't rotate or flip a video but can use a separate utility if required. My S6 screen rotation  is way sensitive. Flips always at wrong time.   Full Review   \n", " Pretty good It needs to be all unlocked,it needs to be able like put words in for titles and when you put it on self e mode it turns negative color but the videos end out awesome if you record them right   Full Review   \n", " Excellent App but one thing... This is a GREAT app...but I do have one little complaint...anytime there is an announcement or update I get a counter on the icon. It will not go away. I now have 14 showing on the icon. If I delete it and put a new icon the 14 comes back. Great app.but fix this guys...I mentioned it several months back and you still have not fixed it. 4 out of 5 stars for that...but otherwise very happy.   Full Review   \n", " Suggestions I add the features I want on it but when I play the video, it lags. When you save and download your video, its fine. I would also love if you add different transitions!! Great app other than that. I also would like the transitions to work with shorter videos, I know a trick how to do that but I would just love it if you could just make the transitions work with shorter, less then one second clips please. This app really helps with my anime editing. So please, you guys are getting better with the updates!   Full Review   \n", " Great editer Love it i use it for my youtube creepersteeve go check it out.       I would like some more things to be added like built in sounds so i don't have to download my own like cuss bleeper sound and elevator music stuff like that but thats just me😄   Full Review   \n", " Best video editor for the price So far the only Android video editing app that resembles praised desktop editors that won't make you pay subscriptions. There is a one-time iap that enables producing vids at full 1080p HD(highest one can go for free is 720p HD) and removes the barely in the way watermark, but that's it. Everything else is usable by anyone who gets this app. Just hope they keep adding new features! One last thing it needs now is gif support for overlays, that would be neat!   Full Review   \n", " Doesn't support 2560-1440 resolution It's 2016 and this app doesn't support front facing video resolution? I wish I knew that before I paid 6 bux. What kind of app doesn't support the #1 type of video taken? Everyone takes front facing video. Fix that and this app would get 5 stars.   Full Review   \n", " Started as 4* now it should be -1 Was great at first, some good stuff for YouTube but then it was saying insufficient storage!                                         Even though I had been deleted everything I had edited then up loaded.l ended up deleting 10 apps and loads of stuff but no joy. It was a good ap  So I deleted ap and reloaded now it says I don't have enough space.but asks if I want to pay £5.00 .don't mind contributing but not with Dick Turpin tactics.        Garbage do not download   Full Review   \n", " Awesome App! Keeps Getting Better The UK410 Will edit the video in 1080p! Well worth the money . My Note3, Galaxy S4 and my LG Gpad 7.0 are all are outputting 1080p.    Yes, I did state that Even My LG GPAD IS EDITING IN 1080P! No other App can touch \"Power Director \" if your you are not using Power Director, your wasting your time,your Mobile Devices potential and your money. Tuesday Aprll 5th . THAT'S It You did it now! You render My laptop Useless by making my phone Better than Windows . My laptop is now A DVD Creator for family Videos.   Full Review   \n", " Its ok Why my music is muted when I do my voice over? Other editors lets me overlay my voice into my soundtrack seamlessly   Full Review   \n", " It's ok... It is an ok app yes. I make all my YouTube videos with it. It is good. It's the fact of... I cannot put my videos in my library of my phone... It only goes onto my mobiles library when I upload it to YouTube... Like... What if I am offline, need to make a video and need to clear the apps data because I don't have enough space? (which happens quite alot) I cannot clear the app or BOOM everything is gone... It is REALLY ANNOYING could you update it so that finished vids can go into library?   Full Review   \n", " I purchased this App Now Won't Work!!! I had purchased this App and after updates now it won't work keeps asking me for License Key... This is Bullshit.   Full Review   \n", " It's great But I wish I could remove the waterdrop without paying the full version. Other than that, this app works amazingly!   Full Review   \n", " Useful and fun It has amazing editing I have fun doing my videos 4 once   Full Review   \n", " So Nice! Maaaaaaaan this app is Sweeeeet! I love it! I Love This App You Hear Me?   Full Review   \n", " Great app but add PiP Support... You guys should add PiP support for Mediatek MT6592. Thanks keep adding more filters and features!   Full Review   \n", " Best video editor app I have one suggestion, please add another video track so i can do multi cam! Please!   Full Review   \n", " Please add video overlay on all devices I am a youtuber with 365 subs and I need video overlay!!! Please make it available to all devices. Your video editor is the best out there and no video overlay let's it down just a little 😯   Full Review   \n", " Awesome I do YouTube and so I use this lots for editing.If you wanna check out my YouTube type RainbowCandy54 to find me =)   Full Review   \n", " Look better then it works To much bling and not enough convenience! I have to hunt down tools and most don't even edit all that precise! The transition are good, yet not enough to make up for the hassle! It's good enough for the little boys and girls, but not much use except a toy! When you create a decent adult video editor, let me know!   Full Review   \n", " Best Best video editor keep up tge good work and updates i rate 5 star i will even love to put 5 diamonds   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.cyberlink.powerdirector.DRA140225_01", "title": ["  PowerDirector Video Editor App ", " "]},
{"reviews": [" Would not work all morning I had my mother's day clip all prepared with like 10 pictures, a song, a caption and every time I tried to post of send it wouldn't finish rendering and went up to only 49%. Wasted so much time   Full Review   \n", " Ugh I spent an hour making an anniversary video with pictures and videos.. The sound on some of the videos wouldn't work some pictures didn't show up at all (even tho they did in the preview) and my music is not there. Now I have to start all over   Full Review   \n", " It's ok The reasons i dislike this app now is because in the older version we could sort the photos easily and the one thing that i want to be add back is text in the edit sections it was so much fun and easy to make videos for YouTube   Full Review   \n", "  Shouldn't have Updated. :(  Not all of my pictures show up now. Started a Flip before update and now its lost somewhere. Had no problems until the update. Uggg how do I delete the update?   Full Review   \n", " Ughhh Its OK This app load so sloww.💁 It need to load fast I'm tired of waiting for it to load for bout a day.   Full Review   \n", " I AM MAD I worked HOURS on a video for it to tell me there was a problem. Yet the video still posted to my flipagram account but the only one that can view it is ME. The link I share and send wont play my video 😠   Full Review   \n", " An unexpected error has occurred \"An unexpected error has occurred. Error in glide load routine.\"  Spent so much time making an awesome flipagram and after the update, I can't resume editing it or access it at all. I get the error above every time. Definitely not cool that you guys are blowing up social media bragging about making mothers day flipagrams and no one can do so. This is an app that people would easily pay for if it worked but judging by reviews from this weekend, you've lost a lot of customers. I too will be looking elsewhere   Full Review   \n", " 49% Really Just installed flipagram because of all the awesome talk about the app, got my mother's day photos and song all ready and it will not render past 49%... I restarted my phone 5 times and the app 2 times and my video will not load past 49% each time... Such a disappointment and waste of time!!   Full Review   \n", "  I was able to pick a specific start with the song I chose right down to the very second. Still able to do that now with the new update by sliding the music pane over, but it limits you to only starting your music through about 75% of the song. I wanted to start my video using about 10 seconds of the ending of a song I like but it limits me. Hard to explain, idk.   Full Review   \n", " DONT DOWNLOAD Ever since the new update your not allowed to download anything! You can't save them privately or post them. Its almost as if you did all this work for no reason because there's no way to access them after. Please fix problems.😊   Full Review   \n", " Locks up, won't let me save the flipagram or post. You send out notification about making mothers day flipagrams but yet the app doesn't work right to do so! I have redone  a flipagram 4 times and can't get it to 'render' past 47%. The app is junk. This is my first time using it and I just want to get this one done and delete the app so frustrating when you make a really nice flipagram for Mother's day and spend how long trying to pick out pictures etc for it not to work correctly. I have read a lot of the reviews and no one ishappy with it anymore!   Full Review   \n", " Would like app if worked. I have glitches, were it seems to get stuck on a photo and not play the rest or repeat it when i dont have a duplicate. Extremely annoying. Fix please.   Full Review   \n", " Use to love this app... now... Used to adore this app... now it gets stuck @49% when \"rendering\" basically I never get to post the amazing videos I make with this app...so disappointed   Full Review   \n", " Online photos please You used to be able to select photos from your Google albums, but now it will only use photos on the device ... Which for me makes it useless - I've already been through the process of selecting the photos, now I have to do it all again and export them to the device in order to make a Flipagram. Please, bring back online photos, not just \"moments\" on the device ...  PS since the update I haven't made a new Flipagram, because of the above, but all the other reviews and the missing options suggest i'd be wasting my time anyway ...  UPDATE. OK, I tried to make a new Flipagram and reduced my rating to one star ... YOU RUINED IT .. just bring the old version back, PLEASE..   UPDATE2 - ok so I tried to make a new Flipagram and it just hangs halfway through processing.  I officially give up on Flipagram.   Full Review   \n", " Used 2 love it I used to love this app I have made so many beautiful flip grams but since the update I can't get it past 52% I made a beautiful mother's day flipgram  and had the perfect song and remade it 3 times before giving up I'm very frustrated I just Uninstalled it and reinstalled it but it did nothing to fix the problem this is very frustrating it takes so long to organize the pictures just the right way and then it won't even upload them please fix this problem.   Full Review   \n", " Please fix Okay so before this update , flipagram was my go-to app to make videos with my snapchat videos and photos.. now everytime I make the video, it won't let me finalize it. Everytime it gets to 10% finalized, it says \"flipagram is unable to finalize, please try again\" & when I try again, it repeats it again and again and again!!!!! PLEASE FIX!!!!!   Full Review   \n", "  It stays rendering at 100% but never actually uploads. I've retried it like 7 times, I just have a bunch of broken files saved on my phone from it. It also randomly skips over some clips when I put a few together.   Full Review   \n", " um I was in love until now.. when it renders (no matter if it's a picture slide or a video slide it STOPS COMPLETELY AT 49%. I have deleted and reinstalled, I've reset my phone. . and now I'm just at a lost for words. I use this app for my business and I would love to keep using it.. lovehate relationship.. other than that, if it stops this foolishness it is, without a doubt, the best editing app I've ever used   Full Review   \n", " Awful Since the new update its been really slow. I cant even save my flipagram! Awful...just terrible...dont install   Full Review   \n", " Keeps freezing! Have tried for many days to post to my profile and renders forever! And never gets past 48% have uninstalled and installed on 2 different occasions and same problem. Have emailed support but still nothing! I'm so annoyed. A week has past and I'm not able to upload it! Ugh. Glad to know I'm not the only one, get it together flipagram!!!   Full Review   \n", " Total rubbish I'm so done with this app. I've given it 2 years of trying and hoping updates would fix issues and while some things have improved (it at least keeps a video you are still creating rather than getting rid of it all if you came off the app, meaning you had to sit there for hours and do it all in one go) other things have got worse! Unbelievable!  Now I can't add a text title to my videos, process of getting music is still a joke, and I spend hours editing a video for it to not render past 50% & fail. Joke.   Full Review   \n", " . It was just fine but it says that there's some error and I can't make any flipagrams   Full Review   \n", " Horrible Won't let me upload. Waited 20 minutes for it to \"render\". Videos don't play through, keeps freezing.   Full Review   \n", " Used to love it With this new update, it gets stuck on 50% when rendering, please fix, because it's really worth 10 stars but not with this issue.   Full Review   \n", " A lot of uploading issues on Samsung devices For the last 3-4 wks this has,not been my go to app due to constant video completion/uploading issues..keeps stopping around 15%..just annoying   Full Review   \n", "  Hours of editing and preparing my video, only to load to 46% and not going any further ... Bring back the old flipagram.   Full Review   \n", " Good way to waste data What a disappointment. Not how it used to be. Doesn't even download when trying to save it. Wasted time and data with this app   Full Review   \n", " Can't finish I have never had trouble with this app but today I have tried all day to make a flipagram and it will not go past 28%.   Full Review   \n", " Please put it back like it was I so love flipagram.  But now you can't do video and music like you use to . Now it's hard and don't understand half of it . Why mess up something that was great . You can't switch your pictures around or use the music you have .  Please put it back like it was   Full Review   \n", " Grrrrrr Pretty pi $$ed off. Had spent a lot of time editing a video and was nearly done. Then i updated the app and its now gone.   Full Review   \n", "  every time i try to post a Flipagram it says there was an error while finalizing it . please fix   Full Review   \n", " Update Ive been on flipagram for maybe a good year and ive loved it. And then u go and update it 😬 the first flipagram was PERFECT there was no need to change anything at all. Then u change nearly EVERYTHING. Some people would even get it confused with vine. So in my opinion and everyone else's i know, cancel the update and bring back the original. Thank you for reading this :3   Full Review   \n", " Horrible! Since the update, it doesn't work at all!  Total waste of my time. Will only let you upload without music. The pictures aren't edited the way I did them, heads cut off. If you try to upload with music it gets stuck at 48%...forever!   Full Review   \n", " 12 only I used to love this app, but now it won't \"render\" past 12! I keep trying and trying but it won't work!   Full Review   \n", "  Does not work as I want!..it just gets stuck in between and doesn't move ahead at all..I was not able to make even a single video with it..   Full Review   \n", " Still won't save videos..... 😣 Love this app! I make videos all the time!  But recently it won't save videos. Please fix this   Full Review   \n", " Used to be great.... What happened? Since updated I now can't add text to photos, synching music to photos is much harder but all that aside.... Spend ages making slideshow only to find it won't render past 49% please fix!   Full Review   \n", " Can't work I can select photo,it's all dark,I love to use this APP,please fix it.   Full Review   \n", "  It's stuck on a video that I watched and won't let me go to my home page   Full Review   \n", " Really good Only bad thing not enough effects ! But I liked it still easy to use ! Xx ☺   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.cheerfulinc.flipagram", "title": ["  Flipagram ", " "]},
{"reviews": [" AMAZING I like this app a lot I use it to make YouTube videos and it let's me edit a wide variety of things without having to download software's. The only negative is that I would like a little bit faster download time but still a great app   Full Review   \n", " RUBBISH When i try to add a VIDEO it lists ALL my photos (3200+), but no videos, or even an option to choose between adding pics or videos. Trying to locate a pic amongst thousands in one single list is utterly ridiculous.       How can anyone find this even remotely useful.       This is the worst of its kind I've come across.   Full Review   \n", " Lame All you need is a water mark not a ending sequence. Finding songs are impossible and i should be able to pick the part of the song i want to use . You guys act like you dont have phones or something   Full Review   \n", " Why does this suck It would not let me add videos to be edited because the resolution was \"too high\" 70%of new phones are quad HD and have a photo resolution to match. Also do you know how fing hard it is to figure out how to delete something   Full Review   \n", "  Extremely easy to use this app. That is a huge positive. The only grievance I have and it's actually a pretty big one is that it can't handle videos that are shot in 1080p. Somebody from the company informed that 720p is the best it will do. This means the quality of anything uploaded to YouTube won't be full hd!   Full Review   \n", " Very low This app is very low, when he saves the video it takes a long time to wait, I'm now using another app and it calls videoshow this app is just amazing, try it!!   Full Review   \n", " PLEASE HELP ME!!! This is a great, great editor I love it but every time I save a video the voice and the video are way off... Like the video will be in one part way ahead before the voice gets there, Please help... I bought the membership and every thing, but this is making me want a refund.   Full Review   \n", " Not worth it. Not only do they put a watermark on your video, they put their logo at the end of it as well. Ridiculous monthly fee to remove it. I'll edit my videos on my PC. Uninstalling.   Full Review   \n", " Video and Sound are out of sync once saved! I just downloaded this app and it was working great, so I immediately upgraded to the $3.99/year premium version to get rid of the watermarks. However, as I went to upload my first video from the app to Instagram, I noticed that the sound and video are no longer synced. Thinking it might be an issue in Instagram's part, I checked the video in my saved files and found that the issue is still there. This app is currently useless to me with this issue. I am unhappy. I emailed them & will give 5 stars if fixed.   Full Review   \n", " Pretty good.. It would be much better if u could  music instead of using  (the lame) the music there..   Full Review   \n", " Easy use but limited clipping capability The app is super easy to figure out which is nice. But when you clip pieces of video,  you don't have the capability to snip it wherever you want - only at specific intervals which is frustrating   Full Review   \n", " The downloading of edited videos are problematic Tried couple times - first time the music didn come on, second time the visuals didnt come on -was just the music, now I cant seem to even download/publish, I keep getting error messages !   Full Review   \n", " Watermark If you have to resort to forcing a watermark on the video and then make ppl upgrade to premium to remove it, then you've failed at adding enough value to being premium   Full Review   \n", " LOVE! Great for Class! This amazing App & Website is the best one out there! It worked perfectly for editing a video for one of my college class assignments, where I recorded and uploaded my speech no problem. I created a great video that flowed so perfectly together. I'm so excited to show it to the rest of the class! This app. is great for students, and super easy to navigate! Thank You!   Full Review   \n", " I Feel Jipped :( Disappointing so far. Terribly distorted and unintelligible audio when attempting to add my own sound recordings. Your music adds great but I dont want your music. I purchased the app because i wanted to create videos with my voiceover. It seems like it could be a good app but i have not recorded my first video functionally and kinda feel jipped.   Full Review   \n", " Great features, bad audio render I compared 3 vid editor apps and I will admit this is the best video editor in easy to use, full of great features and has nice + user friendly UI. Love it. Just, after render the video twice, the audio come too late..   Full Review   \n", " Good application The only things need to fix is why 1 year only. Thanks   Full Review   \n", " THE APP IS FINE BUT I THOUGHT I COULD USE ALL MUSIC & THEMES WITHOUT ANY PAYMENT. AS A CLIENT, WE DEMAND TO KNOW ANY RELATIVE INFO TO THE APP FOR AN INSTANCE THE PRICE! SERIOUSLY THO, THE APP ADMIN SHOULD ALREADY HAVE CONSIDER SHOWING THE PAYMENT INCLUDED IN USING APP FEATURES... ITS SO SAD! I THOUGHT I COULD FREELY ENJOY EDITING :(((((( AND I ALMOST THOUGHT TO COMMENT THAT THIS ONES A GREAT APP BUT SAD TO SAY, I COULDN'T EVEN USE A FREE MUSIC   Full Review   \n", "  On point! Can't complain about the quality of the videos that I've edited with this app. Good job, thanks!   Full Review   \n", "  On the phone you can't rotate pics, it's really hard to change time of photos (say you want to change all 113 to 3 sec instead of 6 well you're going to waste time) it does let you go for a really long time and so far add as many pictures you want. I also had trouble getting my drive photos on. But it's not bad compared to every single other one I tried.   Full Review   \n", " Saved me I was doing a video project and I Couldn't find any apps that was good enough for me. Thank God I the last minute I found this app. At the very last minute I realized that my background music was terrible and I tried every app to remove it. However when I came across this app it gave me themes and background music that went with the video and it worked perfectly.   Full Review   \n", " It's awesome! Everything is good quality. It's awesome. You aren't able to edit really really short videos very well, and you can't rotate videos, but other than that it's awesome. Best video app I've tried! And I've tried lots! Highly recommend this app!!!!!   Full Review   \n", " Lack of precision scrubbing On some videos i can't precisely trim the clip. Whenever i moved the trimmer end point, it jumps to few seconds ahead or before. Please fix.   Full Review   \n", " Just made 2 videos and very impressed I came to store to look for a app to speed or slowmo videos. Came across this.  Really nice app and don't mind paying the yearly fee too. Was wondering if the speed and slow mo feature is available in the paid version?   Full Review   \n", " Sucks Made my first video using this app,  combined and edited two small videos I already had come to fund our it F'd the sound on the video... stupid   Full Review   \n", " Clean interface Easy to use.  Music is distracting.  Transitions would be nice for smoother scene changes.   Full Review   \n", "  I would like to see my previous videos/media already linked and saved to my account so I can edit them on the go. Especially since I've paid for the personal account. When I sign into my account, it says \"no videos uploaded\" when I have 2.   Full Review   \n", " Awesome It was a great app to start of my youtube channel but now i have no more free music to use but it was fun while it lasted   Full Review   \n", " Great Editer You can add music with ease,the only thing I do not like is that you have to buy there extra services, but after I bought them they was well worth the couple of bucks I payed.   Full Review   \n", " It is good It is good though it doesn't have any transitions and the ability to add music needs to be worked on, other than that it's a good app.   Full Review   \n", " Good app I really wanted to start making videos of my hobby and figured this app would do the trick. As I was using the app it works great, but it doesn't do 1080p and slightly reduces sound quality after processing the videos. Also I couldn't seem to find any transitions and special effects that was advertised or I might have overlooked. Hopefully an update would let me do 1080p w/o affecting sound quality.   Full Review   \n", " Love! Loved it. Easy to use. Simple. Beautiful videos   Full Review   \n", "  This app is so good I like it but I do t like when I can't upload it's unfortunately stop I get mad fix I'll give 100%   Full Review   \n", " Galaxy S6 I love it! Would give 5 perfect stars if on the free version, we were able to mix music (length, multiple songs, etc). Also, a feature that's beneficial to filmmakers (transition options, panning within a video clip or picture, etc). Otherwise, dope. Keep it up.   Full Review   \n", " Awesome I've had this app for a while now but now for some reason I can't save videos and no matter how many times I reinstall the app it still doesn't work please fix this   Full Review   \n", " Limited Will not import videos shot on my Nexus 6 because it claims the resolution is too high. What good is an editor if it won't support HD?   Full Review   \n", " Simple and easy Without reading anything or even knowing what it does, I was able to build a blinding video. Hats off to you for building a really good piece of software.   Full Review   \n", " App for the Novice Had to figure out that I can't alternate still photos & videos, had to group them one or the other first. It works great!   Full Review   \n", " No support/functions I looked into any menu possible and long press and short press etc and cannot find functions such as transitions anywhere. I emailed developer to inquire but received no communication. An app of this size should have responding support.   Full Review   \n", " Cant trim music I cant trim music which i select from my library. It will be helpful when you add music trim feature too. i.e. 1:2 to 2:6 from 3 min. music 😃   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.wevideo.mobile.android", "title": ["  Video Editor ", " "]},
{"reviews": [" This app Would of been great if I could actually use it please update soon it doesn't support my phone   Full Review   \n", " Opens and starts OK (can see Frames) but a Popup Message says it doesn't support Android 5, and it closes the APP when dismissed. Might work, without the blocking popup. Uninstalling.   Full Review   \n", "  Give a tutorial because I can't work out how to use it and whenever o went into my gallery it never came up with videos   Full Review   \n", " Plzzz fix Can u plzz support android it doesn't wanna work on me if u fix I will rate 5☆   Full Review   \n", "  Doesn't even work. Its says you can't use it with android .5   Full Review   \n", " Doesn't work Not updated for Android 5. Can't use it   Full Review   \n", " Bruh It would be nice I could use it u need to update somehow!   Full Review   \n", " Updates (I don't hate it) This app doesn't support 5.0 or higher. I will re-rate after the upgrade is done.   Full Review   \n", " Great But I think it should have made the than 4 boxes   Full Review   \n", " Update Asap Please💯 FIX ASAP I WOULD LOVE TO ACTUALLY USE IT😕😕   Full Review   \n", " fix please force stop and didn't work   Full Review   \n", "  Can't work on my phone   Full Review   \n", " Doesn't work on my device I can't even open the app cause it says that it wont work with android 5.0   Full Review   \n", " Hate it Can't use it for my android. Like wtf.   Full Review   \n", " Useless for anyone with Android 5.0 or later Completely and totally useless gives an error message that Android 5.0 isn't supported yet (I have 6.0 though) was released December 2014 so if your phone is newer than that or has been updated since you can't use this app. Its odd too the last update for this app was the same time Android 6.0 was released.   Full Review   \n", "  Doesn't work on Android   Full Review   \n", " That dumb it not working on my iphone6 When. I . but. It. On . it . takes. Off   Full Review   \n", " Video uplode Every time I record a video and go to hit the ✔ the App shuts down.   Full Review   \n", " Need an update I can't use it with my new phone anymore   Full Review   \n", "  When I make a video it doesn't play   Full Review   \n", "  It won't let me add the video   Full Review   \n", "  This app doesn't support my phone   Full Review   \n", "  My phone can't run it :(   Full Review   \n", " Doesn't support android 5 or higher doesn't support android 5 or higher   Full Review   \n", "  It doesn't take 5.0 android.....that's weird....   Full Review   \n", " Una mierda La aplicación de partida es UNA MIERDA, nada más   Full Review   \n", " IT'S USELESS It works but when you try to make or then 2 videos it says \"this version can only make two videos \" I mean why gives us frames when you can only make two videos at a time   Full Review   \n", " Perfect for my video collages on my phone Very easy app to use. I tested it with my son's day at the park. It came together clean. This will be my go-to for video collages on Instagram. Sucks you're just for phones right now. Please upgrade this.   Full Review   \n", " Almost perfect! Please make it available for us to control the volume of the background song! Do that, and I'll definitely give 5 star!! 😊😊   Full Review   \n", " Where the update The update need to come this is my waste of my data   Full Review   \n", " عشق این است عالی عالی هست اینستگرام دوستش دارم خیلی خیلی خوشم میاد   Full Review   \n", " It wouldn't even open It supposedly doesn't support android 5. Step up your game.   Full Review   \n", "  I try if wrked this apps   Full Review   \n", "  Does not support Android 5.0   Full Review   \n", "  error message for galaxy 6- doesn't support this device   Full Review   \n", " ABLE TO DOWNLOAD BUT NOT USE??? 👀 If you can download an app AND its updates, one would speculate that it would be functional but obviously that is a feat that is unobtainable by Leyi App so this uninstall is permanent & there's no need to utilize any of your other apps.   Full Review   \n", " Needs updates Doesn't support Android 5.0 or higher.. When is this due? Will re-rate it after   Full Review   \n", "  Not supported android   Full Review   \n", "  Make it usable for androids😠   Full Review   \n", " No me gusta No me gustó   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.leyiapps.videocollage", "title": ["  Video Collage for Instagram ", " "]},
{"reviews": [" Transitions Why can't I adjust the speed of the transitions? I'll press the adjust button and the speeds don't show up. Other times it will be there but most times it isn't   Full Review   \n", " New Update Since this last update KineMaster became slower and laggy also contains various bugs and the thing i hated most in this update is when i put a transission it says \"you cannot put a transission effect here because one or two clips are short\" even tho my 2 clips are 1min long. PLZ Fix this thanks. Best Vid editor i have yet :)   Full Review   \n", " It takes almost hours to save the project Hi admin, i am using this apps now. And it is my second purchase of this apps. Its really great, easy to use, and many features are released after i purchased it. But, there is one still annoying me which is the project export is very...very.. long. If you are able to see the history of my video, most of them more than 20 minutes and i save it HD. Any one can help me with this issue? Or do you have email that i can reach out?   Full Review   \n", " OK found the solution. The only thing I do to work this app is to RESET my android all the memories are gone but I can use it now.   Full Review   \n", " Eh Overall, this is a decent app to edit on if you're unable to use your PC like I am. I'd like to see more variation in the whole transition area to accommodate for the handful of us that use this to edit fan videos and being able to format the videos into vine videos... ❤✨   Full Review   \n", " Better This Is better than I movie it is free and it does not crash as much but I want the logo  go away because I don't want people  bug me saying do you really use the kine master   Full Review   \n", " A lot of features, but with a few bugs I love this app! It has almost everything you need for effective and high quality video editing all in the convenience of a cell phone program. There are, however, a few bugs still to fix. The app will randomly freeze, requiring me to restart. Also, occasionally when exporting videos, I sometimes pick up errors that require me to re-export such as freezing and audio mismatch. These bugs are inconvenient, but do not make the app unusable unless you are the kind of person gets frustrated easily.   Full Review   \n", " Please Would be a 5 star review if 1080 native support was available on galaxy tab s2 I need something bigger to work on lol. Please make 1080 clip support on samsung tablets without needing to convert to 720   Full Review   \n", " not bad Plz i cant remove the watermark and can you add more powerfull thems help   Full Review   \n", " Why can't I video layer This is a good app but the other update says all features were free but no I still can't overlay a video help plz   Full Review   \n", " Rather use vivavideo Easy to edit but it doesn't run a 60 fps and anything going fast is supremely laggy don't download if someone is running in any of your videos lol so on that note viva video is much much better   Full Review   \n", " Very Impressed! I love making videos with this app especially for my youtube... its a very very awesome and fre editing app and i got the full version without the water mark!!! I love it keep it up!!!   Full Review   \n", " I have problem!!! YU YUPHORIA I have yuphoria and in kinemaster I can't add music fix it and also I CANT VIDEO IN LAST UPDATE PLZZ FIX IT   Full Review   \n", " Nice...But I like it but it video layer won't show up it says press the layer button BT there's no video layer and I even have the full paid version....Plz fix then I'll rate 5 stars and could u pls make the video layer feature supported with all devices?..   Full Review   \n", " WatermarkingChumps Watermarking a supposedly \"free\" app, forcing users to purchase a subscription in order to Save, is cheap, tacky, and makes your company look like an amateur web-based gif maker from the late '90s. Nice going, dipsh1tz.   Full Review   \n", " Computer Graphic & Video Art Pioneer After a month of trying editing apps I chose this.......the new chroma Key is the best I've used in fifty years of video. ..   Full Review   \n", "  I still can't video layer but you guys fixed it? It's really important i get that feature ive contacted about it before   Full Review   \n", " Help Some of my videos won't work and I don't know why please help!   Full Review   \n", " Cool but... Make this happen. When you put a layer, you can put the precise time it will appear and go. It is very hard to just drag the layer if you want that layer to be there at the whole video. Especially when your video is like 20 minutes long and like 10 drags is like a second. Pls. Either that or add a zoom button.   Full Review   \n", " IT LAGS! Mine keeps on lagging when I open the app eventhough I've updated it already.   Full Review   \n", "  Truly great app. for linear video editing. As just about all the timeline splinting, music adding, and other things. Just doesn't like footage from. AZrecorder for some reason.   Full Review   \n", " Builds you up and then lets you down Amazing features, easy to use, but would only export 6-40 sec of 90 sec.  Tried many times, I emailed tech support and they have not gotten back to me. I tried it twice in about a two month period because I needed to create video for a class and I had turn it late both times.  The first time I was able to get around that by exporting the video directly to my phone instead of straight to youtube, but the second time that didn't work. I think it's buggy with certain phones.   Full Review   \n", " Love it but why? I loved the first video. Now I am trying toake a second and every time I go to edit (tried 30 times) it keeps closing, saying just that the app stopped working! Ugh. Wth? Help   Full Review   \n", " Please support 60fps videos and export!!! Please make 60fps videos compatible with KineMaster, and also add support to export movies in 60fps format. Thank you! 😊   Full Review   \n", "  Please make video cropping free, and increase the time for speed control to 2x, 3x or 4x   Full Review   \n", " Mini pro It is mini proffessional app....please some visual effects...and some more good filters..   Full Review   \n", " Awsome but... Its cool but it wont let me export anything now and I have a music video I put together and I cant save it fix plz   Full Review   \n", " Love the new update Changed my whole veiw   Full Review   \n", " Brilliant Love it! So amazing, and endless opourtunitaies!   Full Review   \n", " Good Make that can suport GoPro videos.   Full Review   \n", " Easy and best I love this i have no problems with it at all   Full Review   \n", " 60 FPS please Can you guys add in support for 60 fps   Full Review   \n", " Best video app Its best editing app in app store   Full Review   \n", " no sport my samsung galaxy j7 no sport  this app   Full Review   \n", " It would be better If you added things like screen glitches and video overlays :3   Full Review   \n", " Amazing! Sorry, I didn't know u could, every time I tried it said get pro version.   Full Review   \n", "  How to remove green background in video ...... plz suggest me   Full Review   \n", " please help! I couldn't find video layer on new version kinemaster. please help me..I need it   Full Review   \n", " Sony xperia m5 show bug When video editor complete and save it...now i play it and show video bug..please solved it   Full Review   \n", " Best Editot for YouTube Keep it up!   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.nexstreaming.app.kinemasterfree", "title": ["  KineMaster – Pro Video Editor ", " "]},
{"reviews": [" I might rate it 5 stars. If I could get some instructions, it don't tell you anything about how to make it work, and right now all I have is a blank page. Please help !!!   Full Review   \n", " Format issues Does not save in a format that a galaxy s4 recognizes, and you cannot change the format. You will have to download additional video players. Do not download!   Full Review   \n", " Ok I like this app, but almost all of the effects r locked! Also, you should link to youtube or something so you can dance 2 songs out of your playlist.   Full Review   \n", " Its okay But can extra effects not cost any money but not for ever maby  just for like a limited time only then I promise I'll rate 5 stars please respond   Full Review   \n", " Samsung Galaxy S4 When will Fuzebits make more effects? I hope I same something newer on next upgrade. I usually use this as my video recorder, thank u Fuzebits.   Full Review   \n", " Good, but not the best. If you could pitch the music, that would make it WAY better. It also doesn't focus on my phone. Fix this and I'll rate five stars.   Full Review   \n", "  Hi I was wondering when u make a video does it automatically save ?? But to where though I can't find it on my gallery please help thank you .   Full Review   \n", " I like it I like this app because it lets u do effects to your video and like the effects i have been looking for like the one where it makes two of u or the one where it is called ghost somthing it is great u also get to put music of your own in it well music u own on your electronic anyways the reason i gave it a four star rate is because it does not let u put other pictures and stuff and it does not let u take pictures so ya it doesn't let u edit it with a other edit app cuz i wanted to put captions on my video.   Full Review   \n", " Awesome app !! It's a good app . It has so many things for you to try out. It's a shame you have to pay for some though. I would like it to hear your own voice as well   Full Review   \n", "  Video FX app gives error and not opening in Nexus 6 device  err msg: failed to load required media library  Please fix this   Full Review   \n", " Exelente App Es una Exelente app pero creo que podria mejorar por que aveses se pone mi Cara doble y no se cual es la real y lo gravo mal / Its a Exelent app but I think it could be better because sometimes my face doubles and i dont know wich one is real and i end up with a bad recording   Full Review   \n", " 👍Amazing but.... It's great but it could use a little extension like on the apple app store on video star it's similar but you can add fixes and invent some like the time slow mo or time shake or which background or if u want hearts popping out of the screen or flowers or your picture video on a phone and that would be great !!!!! And of course some of the tools will be purchased and effects  too   Full Review   \n", " Like it, but Curious The visual effects in this application are classic and even original, but I am curious about the storage location. It doesn't seem to want to let me change it. I have a One Plus One and it only saves to /storage /emulated/0 (which isn't accessible through the gallery)... Any ideas on what to do? Thanks   Full Review   \n", " Great, but.... Amazing app, I use it very often I've done many music videos using this app....it would be a 5 star if the would let me import videos to edit even if u had to pay for it   Full Review   \n", " The effects are cool but... I like the effects but I'm trying to use this for a school project and the music doesn't line up with the video. It's a lip sync video for choir, so it's kinda important that it does.   Full Review   \n", " I have no music!!😢 Its sad that I dont have any music on my video but i have it on my phone i just dont understand why its not letting me use the music!😢😢😤😠   Full Review   \n", " This is easy to use and has great features Ignore bad feed back on this app. This is the best free app for music video's iv come across yet. Extremely Thankful to add this app on my device   Full Review   \n", " Alright It used to be good the only thing that really annoyed me is the camera moves in slow motion and its stupid,dont install   Full Review   \n", " IT'S OK BUT... It wont move fast I only have 4 apps so it is not my tablet   Full Review   \n", " Really good but.. I really want an app that will let me cut videos for YouTube not just trim pieces off the start and end!! Please make it happen!!   Full Review   \n", " Bad Okay something is terribly wrong with this on my phone its an android moto G and I can download it fine and everything but when I did I went to music and it won't let me play it how do you fix it   Full Review   \n", " Mind blowing!! But....... Pros:- We can add numerous effects to the video. We can add songs too. That sounds incredible.. Cons:- If I touch 'settings', I can't record video anymore! Because, it shows an error: \"Storage Storage/emulated is not mounted or read only.Recording disabled.\" I can't actually edit the storage in the app! I'm forced to uninstall and reinstall the app to fix that. It's a bug and need to fix.   Full Review   \n", " What's wrong with this app?! I turn it on for the first time and I was met by weird lines across the screen, so all I could record was that. I eventually deleted and reinstalled the app but nothing had changed! Please fix.   Full Review   \n", " I have a suggestion It's awesome, but would be even better if you add a slow motion and fast motion effect. Those would make this app complete for a 5 stars. Can I get a reply on your thoughts about this? *EDIT* I want words to be able to display on the screen. Different fonts too.   Full Review   \n", " It Didnt Work The video didn't work nor did the music i got a black screen even though my camera is perfectly fine! All i can do is use filters and record blackness!!   Full Review   \n", " Not like Video Star People, if you're thinking this is going to be like video star you're going to be disappointed...and also every time I put my record on pause, the music starts from the beginning again...   Full Review   \n", " Won't Upload I have used this app for quite some time. All of a sudden now that I have updated my phone to lollipop, it won't let me upload my videos to my phone anymore. Very disappointed. Please fix! I have tried emailing the developer, and got nothing back.   Full Review   \n", " Great App! Just One problem! The timing on it is off a little after pausing the video to go to another scene. When you fix this it will become a five star app ;) Thanks and much love   Full Review   \n", " Not what it use to be The earlier version was so much better. I even made purchases and recorded a few music videos by inserting my mp3s. Now when I try to do it since the latest update I have a 2 or 3 second delay in audio time, and it also makes a popcorn sounding effect in the background. Your app is not what It use to be. Please fix and I will definitely change my rating of this app to 5 stars. Like it was before.   Full Review   \n", " Oh yeah! Its awesome I was planning to make a horror movie this is great! And I love the effects ^-^   Full Review   \n", " I love this app, but doesnt load anymore!! I paid to get all the features the app comes with and now it won't even load. It keeps informing me that there is an \"error: failed to download required media libraries\" any time I try to start the app. Fix it!   Full Review   \n", " Lg g4 I did what u said and turned it into mp3 format. It wasn't faded anymore but when i clicked it it said couldn't get audio file! So i kept trying and i didn't work.😕   Full Review   \n", " Add more effects and be able to use songs from YouTube Good app but you could add more effects and let people be able to use songs from YouTube then I will rate this app 5 stars   Full Review   \n", " Great but... Add more effects for free like hearts, flowers and a phone screen border   Full Review   \n", "  Love it! The best! Must download!! Better than anything! But can you please add more free effects? Then maybe i can give you 6 stars! Lol   Full Review   \n", " I use it all the time Love this and if you make a video and stop it then click the green play button at the side and then click the button at the top you can see the videos that you have made also when you make a video it doesn't automatically save you have to save it yourself the way I said with clicking the green play button and all that I love this app please could there be an easier way to cut your videos thanks   Full Review   \n", " Pooooooo You should make an updated one that actually comes with some of the latest music and have more effects like an effect that let's u draw on it   Full Review   \n", " I would give 5 stars but... But I bought an album the pentatonix deluxe ... But I don't know how to access it and I have no other songs on my phone. What do I do?   Full Review   \n", "  It's cool that I can record while playing music, but the app is unable to process my request when I try any of the payment methods to remove the watermark. I sent an email on 10/11 to get this resolved and have received no response.   Full Review   \n", " love it but I HATE A EFFECT!! Please get rid of the one named \"drunk\" its offensive and it made my eyes feel weird so take it down!   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.videofx", "title": ["  VideoFX Music Video Maker ", " "]},
{"reviews": [" The best I was sad I couldn't get musically but screw that I love this app but I wish you could keep the editing but make it more like musically   Full Review   \n", "  App is good however the advts are too many! :( hence uninstalled it.   Full Review   \n", " AWESOME I app because I can edit my videos   Full Review   \n", "  YAY A VIDEO 📹 EDITOR WITH NO ADS   Full Review   \n", " Good app Love it....recommended   Full Review   \n", " Forever Lovers I love this app.   Full Review   \n", " I like This app is good   Full Review   \n", "  This is a great app!!! So easy to use and has many effects too. Only issue is the ads.   Full Review   \n", " Pictures Makes gr8 Movie s. ♡♡♡   Full Review   \n", " TOO MANY ADS! I've barely even had it a day and I'm totally bombarded with ads even when the app isn't open! Ridiculous!   Full Review   \n", "  I love this app..   Full Review   \n", " Awesome Easy to use and nice resolution   Full Review   \n", " Its okey I love it   Full Review   \n", " Wow Easy to use   Full Review   \n", "  Had fun editing my snaps   Full Review   \n", "  Super enjoyed   Full Review   \n", " Love it This app is superb ...   Full Review   \n", "  Great fun   Full Review   \n", "  #beincredible   Full Review   \n", "  Perfct:   Full Review   \n", " I'm amazed I thought that this app might be 1 of the apps that doesn't work but it works really well. I just downloaded it like 10 mins ago and I absolutely love it even though I have a hard time pressing the button but what could go wrong. I recommend you to download this app if it doesn't work on you then there might be a problem with the app or with your device.   Full Review   \n", "  I downloaded the app and used it once, seemed to work very well and easily.  The unfortunate part is that I had ad after ad pop up in the few minutes as I attempted to make my video. I can deal with a few ads no problem, many free apps have them, but the problem with this app is it contains adware so after I exited and was no longer using the app I got pop up ads while using other apps. This could be a very good app worthy of 5 stars if it weren't for that. For now I'm uninstalling and will re-install if I need it again then uninstall again immediately after   Full Review   \n", " Why?! An ad came in the middle of my video, and it stopped!! It's a GREAT VIDEO editing app, but why ads in the middle of the video?!   Full Review   \n", " Okay Great application would love a purchase option I don't like ads popping up on my phone. Deleting   Full Review   \n", " Great app Yes,it is a great been heard about it from a friend that used it and recommended it for me hoping to find it useful.   Full Review   \n", "  παρε 5 αστερια γιατι τα αξιζεις. δοκιμασα πολλες ιδιες εφαρμογες . αυτη ειναι απλη αλλα πολυ καλη , χωρις προβληματα. Και κανει καλη δουλεια .μπραβο,very good .!!!!την συνιστώ ανεπιφύλακτα .   Full Review   \n", "  Really great guys.  how do you share the video? I use a Samsung galaxy S7 edge. any help?   Full Review   \n", " :/ Honestly it's an amazing app but it causes ad's to pop up all the time on my phone even when the app isn't being used (please fix it)   Full Review   \n", "  It is a very good app but one should be able to use more photos. Fading effects or transition should be applied to all sizes of photos.  Other than these... App is great   Full Review   \n", " Good, but too much add If can ,please decrease the adds, thank you btw :)   Full Review   \n", " Awesome app but 😥😥 Didn't export or save video, it's showing in draft only 😢😢   Full Review   \n", "  Cool app. But, the matter is... Why my video's colors editing result was turned to violet hue?? Even I didn't use any filter. And, too many ads.. Please fix it. Thanks.   Full Review   \n", "  Photo Video doesn't get saved. It exports something, post that a rendering screen appears and then it just stops. Tried multiple times saving, but was always unsuccessful. Kindly look into this.   Full Review   \n", " Awesome!! It's the first video app I downloaded that didn't disappoint me. It does it all.   Full Review   \n", "  It's OK but the adds kill me every time I do something. Maybe add FX and make videos wavy or static and add more transitions but make them more fun and exciting   Full Review   \n", " None First vid was double exposure once loaded onto YT...  Deleted...  Second vid was good.   But cannot STAND all the ad crap coming through ... Its hideous.  Will keep looking   Full Review   \n", " Garbage This app is garbage I wish I can give it f****** zero Stars waste of space I've been trying literally for three hours to save a video in this stupid app keeps popping up   Full Review   \n", " Awesome app I downloaded the app flipagram for my youtube channel WWE Kathryn and i didnt like the app now and i found a AWESOME APP THAT IS SO COOL   Full Review   \n", " Amazing app It just is easy to work with and no glitch or errors unlike other apps.   Full Review   \n", " Please read this honest review I have a Samsung S7 so everything should work, the app looks good and besides the adds i was really enjoying the app but it turns out it doesn't work, when doing a photo video after 30 minutes of creating a master piece it says rendering and stops, and I'm back to no video only showing on draft. If the apps can do what I downloaded it for deserves a 1 star o no stars   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.vnpkyo.videoslide", "title": ["  Make Videos Pictures And Music ", " "]},
{"reviews": [" Bugs identified I see a bug, hangs in lock window and continuously pops the display On and Off during the hang. My device Moto X Play running on Android Marshmallow. Conclusion : display doesn't respond to power button during hang of background running MX player   Full Review   \n", " Audio format not supporting AC3 audio not supported however VLC media player supports every audio format. This issue is not been solved from many time. I hope MX player supports each and every audio and video format.   Full Review   \n", " Always handles whatever I throw at it Avi, mkv, wav, mp4, you name it.  This is the only player that I have never had any problems with based on file type.   Full Review   \n", " Bug problems I m facing 2 problems after updating marshmallow.. 1st is ac3 audio is not supported, 2nd is when i increase brightness it increases till level 12 then decreases till 15... if these problems solves 5 stars for this app   Full Review   \n", " Y MX ru not able to see my feedback... Pls fix my issue may b it's for other marshmallow users too I cnt kp full brightness in my mxplayer .aftr  updating marshmallow.I am not able to full brightness in 15 .it's OK  if it's in 14 ...pls fix it but if I play in default video player by keepn  full brightness it's fine   Full Review   \n", " Crashing Having loads of problems since switching to a new HTC. On my old device (Android 4) everything ran smoothly but now with a new device (HTC One A9, Android 6) it crashes a lot. Down rated the app from 5 to 2 stars for now.   Full Review   \n", " Good but If I put 15 % bright the  screen will be appear like 1% so please fix that problem if it had no problem I may give five stars   Full Review   \n", " Crashing My god after the update to Android M on my HTC One m8 it crashes constantly when the app moves onto the next video in the queue. It also crashes when multitasking from this app to another. The app used to work fantastic before but they really need to update the app to fix the issues with Android M on the HTC One m8.   Full Review   \n", "  marshmallow 6.0.1 causing a few problems main one I can no longer play videos with the screen off,,,, I'm pretty sure its to do with the new doze mode and I have turned off optimisation for mxplayer and the codec but video plays for about  3 mins then it just stops and the app closes. anyone know how to fix this or temporary workaround??  5 stars when its fixed its great cant live without it.   Full Review   \n", " Keeps crashing for some reason Probably needs an update to fix it. Never crashed like this in so many  years I've been using it.   Full Review   \n", " Superb Very smart video player ,I like it superb, but for your info in one movie it giving me error \"audio format ac3 not supported\" and not getting/hear volume/sound of movie... Please fixed it... Thanks...   Full Review   \n", " Small problem Video's play a little slower than they should, seems to be performance issues with regards to smooth playback for example a video of 1 minute 30 seconds plays for longer than 1 minute 30 seconds. More noticeable on fades.   Full Review   \n", "  Been my favourite video player for a long time, but since the update to Android M on my HTC M8, the app has become unusable. Start playing a video, turn the screen off and on, then the app just hangs. Finish a video and the app just hangs. Have to force stop the app and restart to continue using it. So frustrating when this used to be such a good app.   Full Review   \n", " Great for Lenovo Vibe P1 Marshmallow! I was disappointed with Lenovo's video player so tried a variety including VLC both versions. This MX player is by far the best. It does everything I want it to and more!   Full Review   \n", " Bug's Please the  problem is when I increased the brightness it become dark I can increase the brightness till 14   Full Review   \n", " Too many problems 1st Brightness problem and second one is audio problem. Old version was excellent but new version is like pain in ass for marshmallow   Full Review   \n", " Really hate it No movie audio support always found error in voice chnage processs   Full Review   \n", " 6.0 issues... As others have said... Doesn't work properly on the Htc one m8 running marshmallow.   Full Review   \n", " Useless AC3 audio doesn't support... for all such videos using VLC in my phone!!! Which makes this app useless... provide the codec if u really need positive feedbacks   Full Review   \n", " Problem Problem after mashmelow update screen flicker when the app remains opened and gets normal when closed. Otherwise best app for videos i would love to give 5 stars if bugs get fixed.   Full Review   \n", " OK but... When you pause a video to take a screenshot for example, there is no way to git rid of the ad on top of the video! Consider the idea of allowing the paused video to be ad-free for few seconds, on demand at least!   Full Review   \n", " I Love it... G8 for those who watching movies and videos on smartphone... U can easily increase sounds n screen when u enjoying your favourite videos... 5 star...   Full Review   \n", "  The video play problem somehow fixed itself but the AC3 problem's still there. And the codec doesn't work either. Please fix that too.   Full Review   \n", "  Newer review from 2016 (5 stars): MX Player looks, works, and performs significantly better than the other half a dozen similar apps on my phone. My backup video player is currently VLC, which is a decent player but does not come close to MX Player. That said, there is a feature in VLC that I would really like MX Player to have: Sleep timer. If this feature is added, I'll be happy to support the developers further by purchasing the Pro version.  Original review from 2014 (4 stars): I have a love-hate relationship with MX Player. It looks, works, and performs significantly better than the other half a dozen similar apps on my phone - yes, I do have 6 other players installed - but it comes up short in regards to playing certain video files. It is a pity - and it is often quite frustrating - that there is such a glaring issue, as I'd much rather use MX Player exclusively. For now, my main backup player is BSPlayer, which plays almost video file that I throw at it.   Full Review   \n", " Would have rate you 5 but facing ac3 codec issue Do something with ac3 codec problem for only few files I have to use another v. Player   Full Review   \n", " Good but...... When i switch scroll brightness to 15, the brightness automatically gets dim then i again scroll down to 14 it gets bright.. please fix this bug, its annoying and irritating..   Full Review   \n", " It's OK Good, but can't play any videos via UPnP (even with BubbleUPnP, which works fine with VLC) and, according to Clean Master, autostarts secretly when changing networks, consuming traffic and system resources. Best video player for Android.   Full Review   \n", " Not working in my k3 note. After updating k3 note to marshmallow, it say Component files are corrupted or android internal files are not compatible with current version.   Full Review   \n", "  There was something wrong with the subtitles. The font size is big and not sync. Please fix.   Full Review   \n", " Brightness goes maximum when i open file When i switch videos or open one just a second before it opens brightness goes to maximum! This is so annoying in night coz it hurt my eyes when happen in dark! Plz fix it   Full Review   \n", " No 1 player All are having only one problem:Steps for support ac3 audios 1. Go to Google search the \"neon arm7 zip file\"and go to MX player settings then decoder option in the last option custom decoder and select the already downloaded zip file and mx player automatically restart and it's support ac3 audio files   Full Review   \n", " Got a little problem in Marshmallow I've been using this app for 5 years now, and i liked it so much because it's really simple  to watch videos and control them without disturbing the playback. However, my recent update to Marshmallow have showed some problems. The most noticeable one is that the player would often freeze/crash when i got out from playback. This is quite annoying, as the player sometimes can't prepare itself to play another video, and it crashes when i load another. I hope this will get fixed soon, and thanks for reading!   Full Review   \n", " The Best Player(Except for aac3 support) All features are nice and the app performs flawlessly. However, I find myself using other video apps (yes, VLC) for aac support. Also, a search feature can be added next to the refresh library buton.   Full Review   \n", " Ads once again killing an awesome ap! This player does a lot but the ads covering a portion of the video during playback is annoying and too intrusive for my liking. Get rid of the ads and i will change my rating.   Full Review   \n", " Problem. here Some VIDEO clips DOESN'T support Audio Solve this Issue As early as possible &  Those Video Clips SUPPORT in VLC MEDIA player   Full Review   \n", " Problem After flashing cm13 rom on my phone the Ac3 audio is not supported and hw+ is not working too. Please fix it.   Full Review   \n", " Horrible.  Old version was 5 stars.  Update removed the most common audio codecs making mx player absolutely useless.  Good thing i found custom codecs but thats something i shouldnt have to do. Horrible.  Old version was 5 stars.  Update removed the most common audio codecs making mx player absolutely useless.  Good thing i found custom codecs but thats something i shouldnt have to do.   Full Review   \n", " Not working I decided last year to switch my apple phone for an android phone. Brilliant idea never going back. Then recently I decided that I will switch my I pad to an android tablet as I believe that android gives you better freedom with your media. Boy was I wrong! After purchasing a samsung tab 4 (not top of the line but good to travel with) I was disgusted and frankly pisssed off that it's a massive balls ache trying to play any type of audio from a movie file on my device! Even apple was easier!! I don't fully blame this app but they 'apprantly' have a codec which will resolve this issue, well for me it hasn't. This app works fine on my HTC but on the samsung tab?????? No way hosey! !!! if someone could help me I will retract my statement and walk naked around my home town.   Full Review   \n", "  It lets me organize my videos and watching lists and prefer the best subtitle style by providing so many adjustment tools. You can also make fine and correct adjustment when you want to jump to somewhere in the video and you can change the brightness and the volume easily. The best thing that I love is speeding up or down the playback sound without any sound pitch, that allows me to watch and understand course videos more easily.   Full Review   \n", " Short problem I just updated my phone from 5.1 to 6.0 and i am facing this problem of brightness.. when i enhance the brightness to 15 its reduce the brightness to zero.. it maintain the brightness up to 14..   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.mxtech.videoplayer.ad", "title": ["  MX Player ", " "]},
{"reviews": [" Great! Extremely easy UI, & very fun to use... you even laugh as you are being creative using it. Get it... You'll have a good time & will be pleased with your final video.   Full Review   \n", " Must get It's awesome it helped me to make my YouTube videos   Full Review   \n", " Cant save Good interface and easy to use but it wont render my 20sec clip. It exports it and then when it says rendering...it stops and puts it into my draft project and never renders. Any ideas?   Full Review   \n", " HAPPY! I spent hours looking for the perfect app to edit my videos. I finally came across this and I seriously feel like crying because I finally found the perfect one. THANK YOU SO MUCH!!!!!   Full Review   \n", "  Very nice   Full Review   \n", " Really good app Easy to work with, fun, straight to the point 👌👍   Full Review   \n", "  I finally find an app where I can put my videos together only problem is I can't speed the videos up this app would of got all five stars if speeding was an option   Full Review   \n", " Love it The best   Full Review   \n", " This is such a good movie maker game I think you should buy this because you can add music, stickers, text and much much more!   Full Review   \n", " Soo good I can make such cute vids of my dog on my channel now   Full Review   \n", " Waste of time Dont download this , useless app! Doesn't work properly   Full Review   \n", " I need help.... Im stuck getting sounds for a video from one place and I cant change it! Someone please tell me how I can change it   Full Review   \n", " Awful. Won't even save the videos once I make them.   Full Review   \n", " DO NOT INSTALL!! Ads will interrupt Netflix!! Won't render video!   Full Review   \n", " Love it.. I made the best mother's day video for my mom in just 10 minutes, I have everything I need to make it in this app..💖👈   Full Review   \n", "  Add more Instution to the app and it would be  great because kind of did not understand   Full Review   \n", " very fast tiny output size among others   Full Review   \n", " REALLY BAD the video is cutting ,I just can see half of the video, I can't throw the subtitle and stickers correctly because of that   Full Review   \n", "  Love it but it has some limitations   Full Review   \n", " DJ gregas Pop-up are a major problem cause my phone to lock up   Full Review   \n", "  Very good app.   Full Review   \n", " Super Best app   Full Review   \n", " Ads I hate it when I turn on my phone too see almost five ads that won't go away from this app. Or out of no where I get an ad from this. Hate it.   Full Review   \n", "  Great   Full Review   \n", " Was ok Ok   Full Review   \n", " Perfection Perfect   Full Review   \n", " Hi Tnx   Full Review   \n", "  Awesone   Full Review   \n", " Worst Video doesn't save. After installing, i spent hours to make a video. But when tried to save it, it showed exporting then rendering and then exit. Tried several times, video saves in drafts only. U can't share these videos for which u have spent hours..   Full Review   \n", " Uninstalling Great app however after downloading I'm very disappointed in the fact that every 2-3 minutes different ads pop up on my phone no matter what I do and stops what I'm doing at the moment. If I sit my phone down for a while there are literally 6-7 different ads lined up at the top of my screen which is annoying after 2 weeks being that I made one video. I'm debating on uninstalling for that simple reason I'm sick of being interrupted by ads of apps I do not want. Please fix or show me a better app.   Full Review   \n", " WOW HE S SAVE MY CLIP Anohter video editor app don't save my video.But this work exelent!  Download it!   Full Review   \n", " Amazing app! It allows you to set the duration of each image, its aspect ratio and sync it with the music of your choice! I love it!! Thanks team for this wonderful piece of artwork!   Full Review   \n", " I like it so much. It's really good and I was looking for something like this and I finally found the best one.   Full Review   \n", " It was a good app until... Adds are the most annoying thing ever! And when I bought it they would stop me from even making the video please if you have a Samsung be aware that it says things like I want to chat with you, how to get a girlfriend, all of them are adds   Full Review   \n", " OMG BEST APP!!!♥♥ I love this app it is the best app to make videos IN THE WORLD!!!!! It is SO good that one million people will download it.!! Please download it if you want to make a YouTube channel!!!   Full Review   \n", " Someting is wrong Evrythng was quite fine & after saving it.. It looked worse.. RGB has Changed.. video output is blueish.. Is this app compatible wid all phones if not plz mention it.. i felt so bad after spending so much time making a video n d end result is a failure.. plz fix   Full Review   \n", " A few problems It randomly opens up even when my phone is off. Plus a lot of ads but other then that I think it's a great app   Full Review   \n", " Superb This application is like having a virus! Please complete.☺   Full Review   \n", " Wow, great little app! Wish I could import background music tho.   Full Review   \n", " I was blown away This is THE app I have been looking for it is just amazing thank you and if you are reading this DOWNLOAD THIS APP   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.prettyapp.videomaker", "title": ["  Mini Video Maker - Slide Show ", " "]},
{"reviews": [" Its ok I want my own music but its OK..   Full Review   \n", "  I can only save it to drafts and not gallery? Can't export my video. I'm furious now.   Full Review   \n", "  How do I save my edits to my gallery?!! 😭😭😭😭   Full Review   \n", " The best Muy bueno y eficaz   Full Review   \n", " کریم حرف نداره دست شمادرد نکنه   Full Review   \n", " Lobe it Because u can do alot   Full Review   \n", "  I Like and Loved it.   Full Review   \n", "  I love this apps   Full Review   \n", " BEST You should get this app😉😉😉😉😉   Full Review   \n", " Perfect This is a cool app I made a mother's day slide show for my mum and sue loved it with the romantic music! Good job! And I'm 8 yrs old.   Full Review   \n", " Great app Really great app for video editing n creator.   Full Review   \n", " Picture show Love this   Full Review   \n", "  Satisfied   Full Review   \n", "  Good   Full Review   \n", "  Love it   Full Review   \n", " love it its so amazing   Full Review   \n", " Turtle dick Giggady   Full Review   \n", "  Cool   Full Review   \n", "  عالیه   Full Review   \n", " Cool kid I'm really in love with this game so cool💞💝💕💜😻😍😘😜   Full Review   \n", " Don't waste your time Suck all them advertising keep coming out I cant edit music and people from back round on each slide Suck   Full Review   \n", " OMG I AM OBBSESSED WITH THIS I love it im obbsesed with it whenever i watch my video I laugh the whole way through.Great Job?   Full Review   \n", " Loved it Please tell me how to save videos anyone please help   Full Review   \n", " Edits I use this for all my edits. I also use it to edit YouTube videos and audio swaps. Its perfect for beginners for editing and I recommend it to almost anyone. If you can't stand a little bit of ads, then don't get it.   Full Review   \n", " ♡ Best app for video editing or making the only problem of dis app is continuous advertising even when you're not using the app.. :) but well good app..   Full Review   \n", " loved it awesome. . must download and enjoy. . m so happy. .thanks   Full Review   \n", " Love it It works so good for my videos that's a good editor   Full Review   \n", " 😍😍😍😃😃😃😃 it's so awesome!!!  I'm glad you have this kind of apps.  it's really useful 😀😀😀   Full Review   \n", " Nice I would like to use this application because it's a wonderful to make my life is a great time...   Full Review   \n", " Create videos lickity split! I just created a slideshow in 30 seconds. This app rocks!   Full Review   \n", "  Muito bom... Gostei muito   Full Review   \n", " ? can't edit ...   Full Review   \n", " 😁😁😁😁😀😀😀😀😀😁😁😁😁😂😂😂😅😅😅😇 Use it. It's so awesome!!!!! Try try try!!!! AWESOMENESS   Full Review   \n", " Its okay But Its a little Laggy when i make a video   Full Review   \n", " lovely app nice aplication.i love it   Full Review   \n", " Good Too many adds   Full Review   \n", " Omg This app is the beeeeeeeeessssssssssstttttttttt   Full Review   \n", " As i proceed My life in pictures. ..   Full Review   \n", " I like it Good   Full Review   \n", " Love it Suprb app..   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.lullabieskids.videoslideshow", "title": ["  Video Slideshow Proshow Effect ", " "]},
{"reviews": [" No.. I was wrong. It has limitations You can't add your aac or mp3 audio while creating video from photos.. Hence I am downgrading rating. From 5 to 2. If I get a workaround then I will upgrade it again.   Full Review   \n", " 1080 p Good video editing app but I went with the pro version because it promised 1080 p resolution and it never delivered! Would like my $3.99 back, you shouldn't promise what you don't deliver!   Full Review   \n", " Keep rendering.. Really love this app. But now i have problem. I create video about 11 minute then when i want to save, it still 99% rendering after 4-5 minutes exporting. Few minutes later, still has no video in my gallery..why?   Full Review   \n", " video export i like use this app, but somehow what is wrong with video export performance, in draft the video is good but the export is very poor performance. it's like 3gp format although i bought the pro version and export it with 1080p. please fix this! I want to make surprise video for my wife and i don't like the export performance. i use android marshmallow.   Full Review   \n", " Exceeded my expectations. I was looking for just a plain photo gallery with a slide show and the options and templates included were unbelievable.  I upgraded to the pro version.  Too cute!   Full Review   \n", " Great app but When I try to publish hd version, it gets up to 76% then it restarts. Also when I published it with lower quality, the music I added disappeared :(   Full Review   \n", " Delets progress Dont do a project then buy the app during/after.  It will download install then delete your current work.  Genius there fellas. Thanks a bunch.   Full Review   \n", " Love it! Update- thank you guys for the new update! It now works flawlessly! This is the best video editing app period! Love it!   Full Review   \n", " Super Easy! Amazing app This is by far the best at putting together videos with both photos and video.  Super intuitive and easy.  A++++   Full Review   \n", " A very good app for video creation Well, I figured out my crash problem. So here's a better rating hahaha!   Full Review   \n", " Really good! But some additions needed... Subtitels- you should be able to add shaddows and outlines, more fonts.             Cropping- needs to be more accurate when your Cropping. Otherwise this app is amazing!   Full Review   \n", " Very awesome video editor I recommend it to anyone with a YouTube channel, mine is EthanMLego by the way!   Full Review   \n", " I really like it It's a GREAT way to put a collection of memories together with ease and not pricey.  I really do enjoy it.   Full Review   \n", " LoVe it!! I love being able to edit with videos and photos. Plus, being able to add my choice of music is thee best!   Full Review   \n", " Great I really love it, but one thing I'm having trouble with is when I upload a video, the sound doesn't match with the video it's going by. So when I go to youtube and look at my videos, it's kind of lagging with the sound and video itself. Please fix this as I do youtube videos. Thank you.   Full Review   \n", " Great editor for Android Has the most editing features I've found for Android devices. Fast rendering too.   Full Review   \n", " CRASHING WHEN I TRY TO UPLOAD! please fix this. I just bought the full version! I tried uploading the video but it keeps on crashing! It doesnt even let me save in gallery!  Please fix it ASAP!!!   Full Review   \n", "  There's no tool to split a clip. This would be a very useful feature.   Full Review   \n", " GREAT APP !! 👍 Easy to use, good resolution, nice app overall..   Full Review   \n", " Do not buy, it doesn't work! The update hasn't fixed any of the issues. Speed up/slow-mo do not work. Clip trimming jumps and you can't edit a video correctly. Can I ask when the makers are going to fix the real issues and stop saying the app has been updated when the 2 most important issues are still not fixed???????   Full Review   \n", " Best Video Creation/Edit App I've  tried various top video editing apps. This one has the most features and allows the most detailed control over how you want to create your videos. The themes and effects are a bonus.   Full Review   \n", " Loved it This app is so cool. Adding music,stickers,themes,etc. I used this app for editing my video for my channel. You should add a tool for face cam or overwrite a video with another video. Sorry for my bad english XD   Full Review   \n", " Lovely, user friendly! Recommended! I hope you will add animation effects for the next improvement.   Full Review   \n", " Just right for me This app helps me a lot with my video presentation.   Full Review   \n", " Video dissappear I use your pro version. Why only black screen appear in editor screen everytime I want to edit my 1080 30fps video? Second, many times I only able to export my video in HD not in 1080. Fyi, every videos that I  want to edit is produced from dji phantom 3adv. Please help me to fix it. Thank you.   Full Review   \n", " Perfect Video Pic Editor I find videoshowapp as d best movie editing maker tool !! Keep updating with new features . Kindly anyone suggest to add watermark/ logo in video ???   Full Review   \n", " Don't buy it The same as the free version just a few different things. You make people pay for this while there's nothing new.you should add things like video in video moving text good effect that are not boring. Also I recommend you don't get the pro and free are the same   Full Review   \n", " Satisfied with the apps! Keep up the good work guys.. I scroll the whole night, finally found the use full apps that I'm looking for..   Full Review   \n", " Best new tool! So easy to use!  Had my first video with music and titles done in about 10 minutes   Full Review   \n", "  Pretty good app, but i wish u can make it lighter, it pretty heavy for my phone, although it is lg g3.. Nice app for overal   Full Review   \n", " Don't pay for it!! Its exactly the same as the free version and I spent £3.99 on it just get the free version   Full Review   \n", " No HD Export Bought this because it stated you can export HD 1080.....you can't. Give me my money back please.   Full Review   \n", " Great editing tools Great for making quick highlight videos. Only with I could remove the title option from the themes.   Full Review   \n", " Good program I have used it on a couple of projects. It is awesome that a phone can handle it.   Full Review   \n", "  Good app! but not what i needed   Full Review   \n", " Worth Good editor, my favorite :)   Full Review   \n", "  Can't export and save to My Gallery.   Full Review   \n", "  Do not want you money with this app I downloaded it and it stip all the time   Full Review   \n", " One of the best Most feature laden video editor. Worth buying the paid version.   Full Review   \n", " I liked This app Thanks VideoShow   Full Review   \n"], "link": "https://play.google.com/store/apps/details?id=com.xvideostudio.videoeditorpro", "title": ["  VideoShow Pro -  Video Editor ", " "]}]